Repository: ihhub/fheroes2
Catalog: files/lang/*.po
Languages: nl

source: difficulty|Impossible
nl: Onmogelijk

source: and more...
nl: en meer...

source: Campaign Difficulty
nl: Campagne Moeilijkheid

source: Choose this difficulty if you want to prefer game story over challenge. AI is weaker in comparison with normal difficulty.
nl: Kies deze moeilijkheidsgraad als je de voorkeur geeft aan een spelverhaal boven een uitdaging. AI is zwakker in vergelijking met normale moeilijkheidsgraad.

source: Choose this difficulty to enjoy the campaign as per the original design.
nl: Kies deze moeilijkheidsgraad om van de campagne te genieten volgens het originele ontwerp.

source: Choose this difficulty if you want challenge. AI is stronger in comparison with normal difficulty.
nl: Kies deze moeilijkheidsgraad als je uitdaging wilt. AI is sterker in vergelijking met normale moeilijkheidsgraad.

source: Easy
nl: Makkelijk

source: Normal
nl: Normaal

source: Hard
nl: Moeilijk

source: Start the selected scenario.
nl: Start het geselecteerde scenario.

source: View Intro
nl: Bekijk Intro

source: View Intro videos for the current state of the campaign.
nl: Bekijk Intro videos voor de huidige staat van de campagne

source: Select campaign difficulty. It cannot be changed after.
nl: Selecteer campagne moeilijkheid. Het kan niet later worden gewijzigd.

source: Restart
nl: Herstart

source: Restart the current scenario.
nl: Hetstart het huidige scenario.

source: Are you sure you want to restart this scenario?
nl: Weet je zeker dat je dit scenario wilt herstarten?

source: Campaign Scenario loading failure
nl: Campagne Scenario laad fout.

source: Please make sure that campaign files are correct and present.
nl: Zorg ervoor dat de campagnebestanden correct en aanwezig zijn.

source: Days spent
nl: Dagen besteed

source: The number of days spent on this campaign.
nl: Het nummer van dagen besteed op deze campagne

source: Project Coordination and Core Development
nl: Project Coordiantie en Kern Ontwikkelijk

source: QA and Support
nl: QA en Ondersteuning

source: Development
nl: Ontwikkeling

source: Dev and Support
nl: Ontwikkeling en Ondersteuning

source: Visit us at
nl: Bezoek ons op

source: Special Thanks to
nl: Speciale dank aan

source: and many other contributors!
nl: en vele andere bijdragers!

source: Support us at
nl: Steun ons op

source: Connect with us at
nl: Neem contact met ons op via

source: Need help with the game?
nl: Hulp nodig met het spel?

source: and many-many other supporters!
nl: en vele-vele andere supporters!

source: Original project before 0.7
nl: Origineel project vóór 0.7

source: Designed and Directed
nl: Ontworpen en geregisseerd

source: Programming and Design
nl: Programmeren en Ontwerpen

source: Executive Producer
nl: Uitvoerend Producent

source: Producer
nl: Producent

source: Additional Design
nl: Aanvullend Design

source: Additional Programming
nl: Additional Programmeren

source: Musical Production
nl: Muziek Productie

source: Music and Sound Design
nl: Muziek en Geluid Ontwerp

source: Vocalists
nl: Zangers

source: Assistant Art Director
nl: Assistent Art Director

source: Artists
nl: Artiesten

source: Writing
nl: Schrijven

source: Manual and Helpfile
nl: Handleiding en Hulpbestand

source: Design Lead
nl: Ontwerpleider

source: Designers
nl: Ontwerpers

source: Programming Lead
nl: Programmeerleider

source: Art Lead
nl: Kunstleider

source: Playtesters
nl: Speeltesters

source: Designer
nl: Ontwerper

source: Producers
nl: Producenten

source: Sound Design
nl: Geluid Ontwerp

source: Town Themes
nl: Dorp Themas

source: Alto Sax
nl: Altsaxofoon

source: Harpsichord and Piano
nl: Klavecimbel en piano

source: Basso Vocal
nl: Bas Zang

source: Soprano Vocal
nl: Sopraan Vocaal

source: Recorded at Green Street Studios
nl: Opgenomen bij Green Street Studios

source: German Consultant
nl: Duitse Adviseur

source: Map Designers
nl: Kaart Ontwerpers

source: Package Design
nl: Pakketontwerp

source: Unknown Hero
nl: Onbekende Held

source: Your Name
nl: Jouw Naam

source: Standard
nl: Standaard

source: View High Scores for Standard Maps.
nl: Bekijk High Scores voor Standaard Kaarten.

source: Campaign
nl: Campagne

source: View High Scores for Campaigns.
nl: Bekijk High Scores for Campagnes.

source: This file contains a save with an invalid game type.
nl: Dit bestand bevat een spel met in incorrect spel type.

source: This file was saved by the "The Price of Loyalty" version of the game. Some items may not be available.
nl: Dit bestand was opgeslaagen door de "The Price of Loyalty" versie van het spel. Sommige voorwerpen zijn mogelijk niet beschrikbaar.

source: Usupported save format:
nl: Niet-ondersteunde opslagindeling:

source: Current game version:
nl: Huidige spel versie:

source: Last supported version:
nl: Laats ondersteunde versie:

source: This saved game is localized to '
nl: Dit opgeslagen spel is gelokaliseerd in '

source: ' language, but the current language of the game is '
nl: ' taal, maar de huidige taal van het spel is '

source: Hot Seat
nl: Hete Stoel

source: Play a Hot Seat game, where 2 to 4 players play around the same computer, switching into the 'Hot Seat' when it is their turn.
nl: Speel een Hete Stoel-spel, waarbij 2 tot 4 spelers rond dezelfde computer spelen en overschakelen naar de 'Hete Stoel' wanneer het hun beurt is.

source: Cancel back to the main menu.
nl: Annuleer terug naar het hoofdmenu.

source: A single player game playing out a single map.
nl: Een spel voor één speler dat een enkele kaart speelt.

source: Standard Game
nl: Standaard Spel

source: A single player game playing through a series of maps.
nl: Een spel voor één speler dat door een reeks kaarten wordt gespeeld.

source: Campaign Game
nl: Campagne Spel

source: A multi-player game, with several human players completing against each other on a single map.
nl: Een spel voor meerdere spelers, waarbij verschillende menselijke spelers het tegen elkaar opnemen op een enkele kaart.

source: fheroes2 Resurrection Team presents
nl: Het fheroes2 Ressurection Team presenteert

source: Greetings!
nl: Gegroet!

source: Welcome to Heroes of Might and Magic II powered by fheroes2 engine! Before starting the game please choose game resolution.
nl: Welkom bij Heroes of Might and Magic II aangedreven door fheroes2-engine! Kies de spelresolutie voordat u het spel start.

source: Please Remember
nl: Onthoud alsjeblieft

source: You can always change game resolution by clicking on the
nl: Je kan altijd de spel resolutie weizigen door te drukken op de

source: door
nl: duer

source: on the left side of main menu. To switch between windowed and full screen modes press
nl: op de linker kant van het hoofdmenu. Om te schakelen tussen windowed en volledig scherm modus druk op

source: key on the keyboard. Enjoy the game!
nl: toets op het toetsenboord. Geniet van het spel!

source: Quit Heroes of Might and Magic II and return to the operating system.
nl: Sluit Heroes of Might and Magic II af en keer terug naar het besturingssysteem.

source: View the credits screen.
nl: Bekijk het credits scherm.

source: View the high scores screen.
nl: Bekijk het high scores scherm.

source: Change language, resolution and settings of the game.
nl: Weizig de taal, resolutie en instellingen van het spel.

source: Game Settings
nl: Spel Instellingen

source: Required video files for campaign selection window are missing. Please make sure that all necessary files are present in the system.
nl: Vereiste videobestanden voor het campagneselectievenster ontbreken. Zorg ervoor dat alle benodigde bestanden in het systeem aanwezig zijn.

source: Either Roland's or Archibald's campaign from the original Heroes of Might and Magic II.
nl: Ofwel de campagne van Roland of Archibald uit de originele Heroes of Might and Magic II.

source: Original Campaign
nl: Orginele Campagne

source: Expansion Campaign
nl: Uitbreiding Capmagne

source: One of the four new campaigns from the Price of Loyalty expansion set.
nl: Een van de vier nieuwe campagnes uit de Price of Loyalty-uitbreidingsset.

source: Host
nl: Organisator

source: The host sets up the game options. There can only be one host per network game.
nl: De organisator stelt de spel opties in. Er kan maar 1 organisator zijn per network spel.

source: Guest
nl: Gast

source: The guest waits for the host to set up the game, then is automatically added in. There can be multiple guests for TCP/IP games.
nl: De gast wacht op de organisator om het spel in te stellen, daarna wordt de gast automatisch toegevoegd. Er kunnen meerde gasten zijn voor TCP/IP spellen.

source: Battle Only
nl: Alleen vechten

source: Setup and play a battle without loading any map.
nl: Stel een gevecht in en speel een gevecht zonder een kaart te laden.

source: 2 Players
nl: 2 Spelers

source: Play with 2 human players, and optionally, up to 4 additional computer players.
nl: Speel met 2 menselijke spelers en optioneel tot 4 extra computerspelers.

source: 3 Players
nl: 3 Spelers

source: Play with 3 human players, and optionally, up to 3 additional computer players.
nl: Speel met 3 menselijke spelers en optioneel tot 3 extra computerspelers.

source: 4 Players
nl: 4 Spelers

source: Play with 4 human players, and optionally, up to 2 additional computer players.
nl: Speel met 4 menselijke spelers en optioneel tot 2 extra computerspelers.

source: 5 Players
nl: 5 Spelers

source: Play with 5 human players, and optionally, up to 1 additional computer player.
nl: Speel met 5 menselijke spelers en optioneel tot 1 extra computerspelers.

source: 6 Players
nl: 6 Spelers

source: Play with 6 human players.
nl: Speel met 6 menselijke spelers.

source: Dragon city has fallen! You are now the Master of the Dragons.
nl: Drakenstad is gevallen! Je bent nu de Meester van de Draken.

source: You captured %{name}! You are victorious.
nl: Je hebt %{name} verovert! Je bent overwinnaar!

source: You have captured the enemy hero %{name}! Your quest is complete.
nl: Je hebt de vijandelijke held %{name} gevangengenomen! Je zoektocht is voltooid.

source: You have found the %{name}. Your quest is complete.
nl: Je hebt de %{name} gevonden. Je zoektocht is voltooid.

source: Ultimate Artifact
nl: Ultime Artefact

source: The enemy is beaten. Your side has triumphed!
nl: De veihand is verslagen. Jouw kant heeft gezegevierd!

source: You have built up over %{count} gold in your treasury. All enemies bow before your wealth and power.
nl: U heeft meer dan %{count} goud in uw schatkist opgebouwd. Alle vijanden buigen voor uw rijkdom en macht.

source: The enemy has captured %{name}! They are triumphant.
nl: De vijand heeft %{name} veroverd! Ze zijn triomfantelijk.

source: The enemy has built up over %{count} gold in his treasury. You must bow done in defeat before his wealth and power.
nl: De vijand heeft meer dan %{count} goud in zijn schatkist opgebouwd. Je moet in een nederlaag buigen voor zijn rijkdom en macht.

source: You have been eliminated from the game!!!
nl: Je bent geelimineerd van het spel!!!

source: You have lost the hero %{name}. Your quest is over.
nl: Je hebt de held %{name} veloren. Je zoektocht is voorbij.

source: You have failed to complete your quest in time. All is lost.
nl: Je hebt je zoektocht niet op tijd voltooid. Alles is verloren.

source: Defeat all enemy heroes and capture all enemy towns and castles.
nl: Versla alle vijandelijke helden en verover alle vijandige steden en kastelen.

source: Run out of time. (Fail to win by a certain point.)
nl: Geen tijd meer. (Winnen op een bepaald punt lukt niet.)

source: Capture the castle '%{name}'.
nl: Verover het kasteel '%{name}'

source: Capture the town '%{name}'.
nl: Verover het dorp '%{name}

source: Defeat the hero '%{name}'.
nl: Versla de helf '%{name}'

source: Find the ultimate artifact.
nl: Find het ultime artefact

source: Find the '%{name}' artifact.
nl: Find de '%{name}' artefact

source: Accumulate %{count} gold.
nl: Verzamel %{count} goud.

source: , or you may win by defeating all enemy heroes and capturing all enemy towns and castles.
nl: , of je kunt winnen door alle vijandelijke helden te verslaan en alle vijandige steden en kastelen te veroveren.

source: Lose the castle '%{name}'.
nl: Verlies het kasteel '%{name}.'

source: Lose the town '%{name}'.
nl: Verlies het dorp '%{name}.'

source: Lose the hero: %{name}.
nl: Verlies de held: %{name}.

source: Fail to win by the end of month %{month}, week %{week}, day %{day}.
nl: Win niet tegen het einde van maand %{month}, week %{week}, dag %{day}.

source: %{color} player has been vanquished!
nl: %{color} speler is verslagen!

source: Do you wish to continue the game?
nl: Wil je doorgaan met het spel?

source: Game Difficulty:
nl: Spel Moeilijkheid:

source: Opponents:
nl: Tegenstanders:

source: Class:
nl: Klasse:

source: Rating %{rating}%
nl: Beoordeling %{rating}%

source: Click here to select which scenario to play.
nl: Klik hier om te selecteren welk scenario te spelen.

source: Game Difficulty
nl: Spel Moeilijkheid

source: This lets you change the starting difficulty at which you will play. Higher difficulty levels start you of with fewer resources, and at the higher settings, give extra resources to the computer.
nl: Hiermee kunt u de moeilijkheidsgraad waarmee u gaat spelen wijzigen. Hogere moeilijkheidsgraden beginnen je met minder middelen, en bij de hogere instellingen, geef je extra middelen aan de computer.

source: Difficulty Rating
nl: Moeilijkheids Beoordeling

source: The difficulty rating reflects a combination of various settings for your game. This number will be applied to your final score.
nl: De moeilijkheidsgraad weerspiegelt een combinatie van verschillende instellingen voor je spel. Dit nummer wordt toegepast op je eindscore.

source: Click to accept these settings and start a new game.
nl: Klik om deze instellingen te accepteren en een nieuw spel te starten.

source: Click to return to the main menu.
nl: Klik om terug te keren naar het hoofdmenu.

source: No maps available!
nl: Geen kaarten beschrikbaar!

source: Astrologers proclaim the Month of the %{name}.
nl: Astrologen roepen de maand van de %{name} uit.

source: Astrologers proclaim the Week of the %{name}.
nl: Astrologen roepen de week van de %{name} uit.

source: After regular growth, the population of %{monster} is doubled!
nl: Na regelmatige groei is de populatie van %{monster} verdubbeld!

source: After regular growth, the population of %{monster} increases by %{count} percent!
nl: Na regelmatige groei neemt de populatie van %{monster} toe met %{count} procent!

source: %{monster} growth +%{count}.
nl: %{monster} groei +%{count}.

source: All populations are halved.
nl: Alle populaties zijn gehalveerd.

source: All dwellings increase population.
nl: Alle woningen vergroten bevolking.

source: %{color} player, this is your last day to capture a town, or you will be banished from this land.
nl: %{color} speler, dit is je laatste dag om een stad te veroveren, anders word je uit dit land verbannen.

source: %{color} player, you only have %{day} days left to capture a town, or you will be banished from this land.
nl: %{color} speler, je hebt nog maar %{day} dagen om een stad te veroveren, anders word je uit dit land verbannen.

source: %{color} player's turn.
nl: %{color} speler's beurt.

source: Do you want to transfer control from you to the AI? The effect will take place only on the next turn.
nl: Wil je de controle van jou overdragen aan de AI? Het effect zal pas bij de volgende beurt plaatsvinden.

source: %{color} player, you have lost your last town. If you do not conquer another town in next week, you will be eliminated.
nl: %{color} speler, je bent je laatste stad kwijt. Als je volgende week geen andere stad verovert, word je geelimineerd.

source: %{color} player, your heroes abandon you, and you are banished from this land.
nl: %{color} speler, je helden laten je in de steek en je wordt uit dit land verbannen.

source: Next Hero
nl: Volgende Held

source: Select the next Hero.
nl: Selecteer de volgende Held.

source: Continue Movement
nl: Vervolg Bewegning

source: Continue the Hero's movement along the current path.
nl: Vervolg de beweging van de held langs het huidige pad.

source: Kingdom Summary
nl: Koninkrijk Samenvatting

source: View a Summary of your Kingdom.
nl: Bekijk een samenvatting van je koninkrijk.

source: Cast an adventure spell.
nl: Spreek een avonturenspreuk uit.

source: End Turn
nl: Beëindig Beurt

source: End your turn and left the computer take its turn.
nl: Beëindig je beurt en laat de computer aan de beurt.

source: Adventure Options
nl: Avontuur Opties

source: Bring up the adventure options menu.
nl: Open het menu met avontuuropties.

source: Bring up the file options menu, allowing you to load, save, start a new game or quit.
nl: Open het menu met bestandsopties, zodat u kunt laden, opslaan, een nieuw spel kunt starten of kunt afsluiten.

source: File Options
nl: Bestand Opties

source: Bring up the system options menu, allowing you to customize your game.
nl: Open het menu met systeemopties, zodat u uw spel kunt aanpassen.

source: One or more heroes may still move, are you sure you want to end your turn?
nl: Een of meer helden mogen nog bewegen, weet je zeker dat je je beurt wilt beëindigen?

source: Are you sure you want to quit?
nl: Weet je zeker dat je wilt stoppen?

source: Are you sure you want to restart? (Your current game will be lost.)
nl: Weet je zeker dat je opnieuw wilt opstarten? (Je huidige spel gaat verloren.)

source: Are you sure you want to overwrite the save with this name?
nl: Weet je zeker dat u de opslag met deze naam wilt overschrijven?

source: Game saved successfully.
nl: Spel succesvol opgeslagen.

source: There was an issue during saving.
nl: Er is een probleem opgetreden tijdens het opslaan.

source: Are you sure you want to load a new game? (Your current game will be lost.)
nl: Weet je zeker dat je een nieuw spel wilt laden? (Je huidige spel gaat verloren.)

source: Try looking on land!!!
nl: Probeer op het land te kijken!!!

source: After spending many hours digging here, you have uncovered the %{artifact}.
nl: Na vele uren hier te hebben gegraven, heb je het %{artefact} ontdekt.

source: Congratulations!
nl: Gefeliciteerd!

source: Nothing here. Where could it be?
nl: Niets hier. Waar zou het kunnen zijn?

source: Try searching on clear ground.
nl: Probeer te zoeken op onbelemmerd terrein.

source: Digging for artifacts requires a whole day, try again tomorrow.
nl: Het graven naar artefacten duurt een hele dag, probeer het morgen opnieuw.

source: A miniature view of the known world. Left click to move viewing area.
nl: Een miniatuurweergave van de bekende wereld. Klik met de linkermuisknop om het weergavegebied te verplaatsen.

source: World Map
nl: Wereld Kaart

source: Month: %{month} Week: %{week}
nl: Maand: %{month} Week: %{week}

source: Day: %{day}
nl: Dag: %{day{

source: You find a small quantity of %{resource}.
nl: Je hebt een klein beetje van %{resource} gevonden.

source: Status Window
nl: Statusvenster

source: This window provides information on the status of your hero or kingdom, and shows the date.
nl: Dit venster geeft informatie over de status van je held of koninkrijk en toont de datum.

source: This window provides information on the status of your hero or kingdom, and shows the date. Left click here to cycle through these windows.
nl: Dit venster geeft informatie over de status van je held of koninkrijk en toont de datum. Klik hier met de linkermuisknop om door deze vensters te bladeren.

source: This lets you change player starting positions and colors. A particular color will always start in a particular location. Some positions may only be played by a computer player or only by a human player.
nl: Hiermee kun je de startposities en kleuren van spelers veranderen. Een bepaalde kleur begint altijd op een bepaalde locatie. Sommige posities mogen alleen door een computerspeler of alleen door een menselijke speler worden gespeeld.

source: This lets you change the class of a player. Classes are not always changeable. Depending on the scenario, a player may receive additional towns and/or heroes not of their primary alignment.
nl: Hiermee kun je de klasse van een speler wijzigen. Klassen zijn niet altijd veranderlijk. Afhankelijk van het scenario kan een speler extra steden en/of helden krijgen die niet tot hun primaire groep behoren.

source: This lets you change the handicap of a particular player. Only humans may be handicapped. Handicapped players start with fewer resources and earn 15 or 30% fewer resources per turn for mild and severe handicaps, respectively.
nl: Hiermee kunt u de handicap van een bepaalde speler wijzigen. Alleen mensen kunnen gehandicapt zijn. Gehandicapte spelers beginnen met minder middelen en verdienen respectievelijk 15 of 30% minder middelen per beurt voor milde en ernstige handicaps.

source: %{color} player
nl: %{color} speler

source: No Handicap
nl: Geen Handicap

source: No special restrictions on start resources and earning them per turn.
nl: Geen speciale beperkingen op startbronnen en het verdienen ervan per beurt.

source: Mild Handicap
nl: Lichte Handicap

source: Mild handicapped players start with fewer resources and earn 15% fewer resources per turn.
nl: Licht gehandicapte spelers beginnen met minder grondstoffen en verdienen 15% minder "middelen per beurt.

source: Severe Handicap
nl: Erge Handicap

source: Severe handicapped players start with fewer resources and earn 30% fewer resources per turn.
nl: Ernstig gehandicapte spelers beginnen met minder middelen en verdienen 30% minder middelen per beurt.

source: View %{skill} Info
nl: Bekijk %{skill} Info

source: Kingdom Income
nl: Koninkrijk Inkomen

source: Kingdom Income per day.
nl: Koninkrijk Inkomen per dag.

source: English
nl: Engels

source: French
nl: Frans

source: Polish
nl: Pools

source: German
nl: Duits

source: Russian
nl: Russisch

source: Italian
nl: Italiaans

source: Czech
nl: Tsjechisch

source: Norwegian
nl: Noors

source: Belarusian
nl: Wit-Russisch

source: Bulgarian
nl: Bulgaars

source: Ukrainian
nl: Oekraïens

source: Romanian
nl: Roemeense

source: Spanish
nl: Spaans

source: Swedish
nl: Zweeds

source: Portuguese
nl: Portugees

source: Dutch
nl: Nederlands

source: %{object} robber
nl: %{object} dief

source: %{object} raided
nl: %{object} overvallen

source: Sister Eliza
nl: Zuster Eliza

source: Brother Brax
nl: Broeder Brax

source: gives you maximum morale
nl: geeft je maximaal moreel

source: gives you maximum luck
nl: geeft je maximaal geluk

source: You cannot pick up this artifact, you already have a full load!
nl: Je kunt dit artefact niet oppakken, je hebt al een volledige lading!

source: To cast spells, you must first buy a spell book for %{gold} gold.
nl: Om spreuken uit te spreken, moet je eerst een spreukenboek kopen voor %{gold} goud.

source: Unfortunately, you seem to be a little short of cash at the moment.
nl: Helaas lijkt het erop dat je op dit moment wat geld tekort komt.

source: Do you wish to buy one?
nl: Wil je er een kopen?

source: %{count} / day
nl: %{count} per dag

source: one
nl: een

source: two
nl: twee

source: A whirlpool engulfs your ship. Some of your army has fallen overboard.
nl: Een draaikolk overspoelt uw schip. Een deel van je leger is overboord gevallen.

source: Insulted by your refusal of their offer, the monsters attack!
nl: Beledigd door jouw weigering van hun aanbod, vallen de monsters aan!

source: The %{monster}, awed by the power of your forces, begin to scatter. Do you wish to pursue and engage them?
nl: Het %{monster}, onder de indruk van de kracht van je troepen, begint zich te verspreiden. Wil je ze najagen en betrekken?

source: Ransacking an enemy camp, you discover a hidden cache of treasures.
nl: Door een vijandelijk kamp te plunderen, ontdek je een verborgen schatkamer.
