Repository: ihhub/fheroes2
Catalog: files/lang/*.po
Languages: nl

source: A magical barrier stands tall before you, blocking your way. Runes on the arch read, "Speak the key and you may pass." As you speak the magic word, the glowing barrier dissolves into nothingness.
nl: Een magische barrière staat hoog voor je en blokkeert je weg. Runen op de boog lezen: "Spreek de sleutel en je mag passeren." Terwijl je het toverwoord uitspreekt, lost de gloeiende barrière op in het niets.

source: A magical barrier stands tall before you, blocking your way. Runes on the arch read, "Speak the key and you may pass." You speak, and nothing happens.
nl: Een magische barrière staat hoog voor je en blokkeert je weg. Runen op de boog lezen: "Spreek de sleutel en je mag passeren." Je spreekt en er gebeurt niets.

source: You enter the tent and see an old woman gazing into a magic gem. She looks up and says, "In my travels, I have learned much in the way of arcane magic. A great oracle taught me his skill. I have the answer you seek."
nl: Je gaat de tent binnen en ziet een oude vrouw staren in een magisch juweel. Ze kijkt op en zegt: "Tijdens mijn reizen heb ik veel geleerd op het gebied van mysterieuze magie. Een groot orakel heeft me zijn vaardigheid geleerd. Ik heb het antwoord dat je zoekt."

source: Spell book is not present.
nl: Spreukenboek is niet aanwezig.

source: That spell costs %{mana} mana. You only have %{point} mana, so you can't cast the spell.
nl: Die spreuk kost %{mana} mana. Je hebt alleen %{point} mana, dus je kunt de spreuk niet spreken.

source: The spell was not found.
nl: De spreuk is niet gevonden.

source: Only heroes can cast this spell.
nl: Alleen helden kunnen deze spreuk uitspreken.

source: Your hero is too tired to cast this spell today. Try again tomorrow.
nl: Je held is te moe om deze spreuk vandaag uit te spreken. Probeer het morgen opnieuw.

source: You do not currently own any town or castle, so you can't cast the spell.
nl: Je bezit momenteel geen stad of kasteel, dus je kunt de spreuk niet gebruiken.

source: This hero is already in a town, so you can't cast the spell.
nl: Deze held is al in een stad, dus je kunt de spreuk niet uitspreken.

source: The nearest town is %{town}. This town is occupied by your hero %{hero}.
nl: Het dichtstbijzijnde dorp is %{town}. Dit dorp is bezet door je held %{hero}.

source: %{name} the %{race} (Level %{level})
nl: %{name} de %{race} (Level %{level})

source: 'Grouped' combat formation bunches your army together in the center of your side of the battlefield.
nl: 'Gegroepeerde' gevechtsformatie bundelt je leger in het midden van jouw kant van het slagveld.

source: Are you sure you want to dismiss this Hero?
nl: Weet je zeker dat je deze held wilt ontslaan?

source: View Experience Info
nl: Ervaringsinfo bekijken

source: View Spell Points Info
nl: Informatie over spreukpunten bekijken

source: Set army combat formation to 'Spread'
nl: Stel legergevechtsformatie in op 'Sprijd'

source: Set army combat formation to 'Grouped'
nl: Stel legergevechtsformatie in op 'Gegroepeerd'

source: Exit Hero Screen
nl: Verlaat Helden Scherm

source: You cannot dismiss a hero in a castle
nl: Je kunt een held niet wegsturen in een kasteel

source: Dismissal of %{name} the %{race} is prohibited by scenario
nl: Ontslag van %{name} de %{race} is per scenario verboden

source: Dismiss %{name} the %{race}
nl: Sluit %{name} de %{race} af

source: Show previous hero
nl: Bekijk vorige held

source: Show next hero
nl: Bekijk volgende held

source: Blood Morale
nl: Bloed moreel

source: %{morale} Morale
nl: %{morale} Moreel

source: %{luck} Luck
nl: %{luck} Geluk

source: Current Luck Modifiers:
nl: Huidige geluksmodifiers:

source: Current Morale Modifiers:
nl: Huidige moreelmodifiers:

source: Entire army is undead, so morale does not apply.
nl: Het hele leger is ondood, dus het moreel is niet van toepassing.

source: Current experience %{exp1}. Next level %{exp2}.
nl: Huidige ervaring %{exp1}. Volgend level %{exp2}.

source: %{name} currently has %{point} spell points out of a maximum of %{max}. The maximum number of spell points is 10 times your knowledge. It is occasionally possible to have more than your maximum spell points via special events.
nl: %{name} heeft momenteel %{point} spellingspunten van een maximum van %{max}. Het maximale aantal spellingspunten is 10 keer je kennis. Het is af en toe mogelijk om meer dan je maximale spreukpunten te hebben via speciale evenementen.

source: %{name1} meets %{name2}
nl: %{name1} ontmoet %{name2}

source: Town Portal
nl: Dorp Portaal

source: Select town to port to.
nl: Selecteer de stad waarnaar u wilt overdragen.

source: %{spell} failed!!!
nl: %{spell} is gefaald!!!

source: This spell is already in use.
nl: Deze spreuk is al in gebruik

source: Enemy heroes are now fully identifiable.
nl: Vijandelijke helden zijn nu volledig herkenbaar.

source: This spell cannot be used on a boat.
nl: Deze spreuk kan niet op een boot worden gebruikt.

source: This spell can be casted only nearby water.
nl: Deze spreuk kan alleen in de buurt van water worden gebruikt.

source: You must be within %{count} spaces of a monster for the Visions spell to work.
nl: Je moet binnen %{count} ruimtes van een monster zijn om de Visions-spreuk te laten werken.

source: The creatures are willing to join us!
nl: De schepsels zijn bereid om met ons mee te doen!

source: All the creatures will join us...
nl: Alle schepsels zullen zich bij ons voegen...

source: The creature will join us...
nl: Het wezen zal zich bij ons voegen...

source: for a fee of %{gold} gold.
nl: voor een tarief van %{gold} goud.

source: These weak creatures will surely flee before us.
nl: Deze zwakke wezens zullen zeker voor ons vluchten.

source: I fear these creatures are in the mood for a fight.
nl: Ik vrees dat deze wezens in de stemming zijn voor een gevecht.

source: You must be standing on the entrance to a mine (sawmills and alchemists don't count) to cast this spell.
nl: Je moet bij de ingang van een mijn staan (zagerijen en alchemisten tellen niet mee) om deze spreuk uit te spreken.

source: Your attack skill is a bonus added to each creature's attack skill.
nl: Je aanvalsvaardigheid is een bonus die wordt toegevoegd aan de aanvalsvaardigheid van elk wezen.

source: Your defense skill is a bonus added to each creature's defense skill.
nl: Je verdedigingsvaardigheid is een bonus die wordt toegevoegd aan de verdedigingsvaardigheid van elk wezen.

source: Your spell power determines the length or power of a spell.
nl: Je spreukkracht bepaalt de lengte of kracht van een spreuk.

source: Your knowledge determines how many spell points your hero may have. Under normal circumstances, a hero is limited to 10 spell points per level of knowledge.
nl: Je kennis bepaalt hoeveel spreukpunten je held mag hebben. Onder normale omstandigheden is een held beperkt tot 10 spreukpunten per kennisniveau.

source: Current Modifiers:
nl: Huidige Modifiers:

source: skill|Basic
nl: Simpel

source: skill|Advanced
nl: Geavanceerd

source: skill|Expert
nl: Expert

source: Pathfinding
nl: Padvinden

source: Archery
nl: Boogschieten

source: Logistics
nl: Logistiek

source: Diplomacy
nl: Diplomacie

source: Navigation
nl: Navigatie

source: Leadership
nl: Leiderschap

source: Wisdom
nl: Wijsdom

source: Mysticism
nl: Mystiek

source: Ballistics
nl: Ballistiek

source: Eagle Eye
nl: Adelaarsoog

source: Necromancy
nl: Necromantie

source: Estates
nl: Landgoederen

source: Advanced Archery
nl: Geavanceerd Boogschieten

source: Advanced Pathfinding
nl: Geavanceerd Padvinden

source: Basic Archery
nl: Simpel Boogschieten

source: Basic Pathfinding
nl: Simpel Padvinden

source: Expert Pathfinding
nl: Expert Padvinden

source: Advanced Logistics
nl: Geavanceerd Logistiek

source: Basic Logistics
nl: Simpel Logistiek

source: Basic Scouting
nl: Simpel Scouting

source: Expert Archery
nl: Expert Boogschieten

source: Expert Logistics
nl: Expert Logistiek

source: Advanced Diplomacy
nl: Geavanceerd Diplomacie

source: Advanced Scouting
nl: Geavanceerd Scouting

source: Basic Diplomacy
nl: Simpel Diplomacie

source: Expert Diplomacy
nl: Expert Diplomacie

source: Advanced Leadership
nl: Geavanceerd Leiderschap

source: Advanced Navigation
nl: Geavanceerd Navigatie

source: Basic Leadership
nl: Simpel Leiderschap

source: Basic Navigation
nl: Simpel Navigatie

source: Expert Navigation
nl: Expert Navigatie

source: Advanced Wisdom
nl: Geavanceerd Wijsdom

source: Basic Mysticism
nl: Simpel Mystiek

source: Basic Wisdom
nl: Simpel Wijsdom

source: Expert Leadership
nl: Expert Leiderschap

source: Expert Wisdom
nl: Expert Wijsdom

source: Advanced Luck
nl: Geavanceerd

source: Advanced Mysticism
nl: Geavanceerd Mystiek

source: Basic Luck
nl: Simpel Geluk

source: Expert Luck
nl: Expert Geluk

source: Expert Mysticism
nl: Expert Mystiek

source: Advanced Ballistics
nl: Geavanceerd Ballistiek

source: Advanced Eagle Eye
nl: Geavanceerd Adelaarsoog

source: Basic Ballistics
nl: Simpel Ballistiek

source: Basic Eagle Eye
nl: Simpel Adelaarsoog

source: Expert Ballistics
nl: Expert Ballistiek

source: Advanced Necromancy
nl: Geavanceerd Necromantie

source: Basic Estates
nl: Simpel Landgoederen

source: Basic Necromancy
nl: Simpel Necromantie

source: Expert Eagle Eye
nl: Expert Necromantie

source: Advanced Estates
nl: Geavanceerd Landgoederen

source: Expert Estates
nl: Expert Landgoederen

source: %{skill} reduces the movement penalty for rough terrain by %{count} percent.
nl: %{skill} vermindert de bewegingsstraf voor ruw terrein met %{count} procent.

source: %{skill} eliminates the movement penalty for rough terrain.
nl: %{skill} elimineert de bewegingsstraf voor ruw terrein.

source: %{skill} increases the damage done by range attacking creatures by %{count} percent.
nl: %{skill} verhoogt de schade die wordt aangericht door wezens die het bereik aanvallen met %{count} procent.

source: %{skill} increases your hero's movement points by %{count} percent.
nl: %{skill} verhoogt de bewegingspunten van je held met %{count} procent.

source: %{skill} increases your hero's viewable area by one square.
nl: %{skill} vergroot het zichtbare gebied van je held met één vierkant.

source: %{skill} allows you to negotiate with monsters who are weaker than your group.
nl: Met %{skill} kun je onderhandelen met monsters die zwakker zijn dan je groep.

source: Approximately %{count} percent of the creatures may offer to join you.
nl: Ongeveer %{count} procent van de wezens kan aanbieden om met je mee te doen.

source: All of the creatures may offer to join you.
nl: Alle wezens kunnen aanbieden om met je mee te doen.

source: %{skill} increases your hero's movement points over water by %{count} percent.
nl: %{skill} verhoogt de bewegingspunten van je held boven water met %{count} procent.

source: %{skill} increases your hero's troops morale by %{count}.
nl: %{skill} verhoogt het moreel van de troepen van je held met %{count}.

source: %{skill} allows your hero to learn third level spells.
nl: Met %{skill} kan je held spreuken van het derde niveau leren.

source: %{skill} allows your hero to learn fourth level spells.
nl: Met %{skill} kan je held spreuken van het vierde niveau leren.

source: %{skill} allows your hero to learn fifth level spells.
nl: Met %{skill} kan je held spreuken van het vijfde niveau leren.

source: %{skill} regenerates one of your hero's spell points per day.
nl: %{skill} regenereert een van de spreukpunten van je held per dag.

source: %{skill} increases your hero's luck by %{count}.
nl: %{skill} verhoogt het geluk van je held met %{count}.

source: %{skill} gives your hero's catapult shots a greater chance to hit and do damage to castle walls.
nl: %{skill} geeft de katapultschoten van je held een grotere kans om kasteelmuren te raken en schade aan te richten.

source: %{skill} gives your hero's catapult an extra shot, and each shot has a greater chance to hit and do damage to castle walls.
nl: %{skill} geeft de katapult van je held een extra schot, en elk schot heeft een grotere kans om de kasteelmuren te raken en schade aan te richten.

source: %{skill} gives your hero's catapult an extra shot, and each shot automatically destroys any wall, except a fortified wall in a Knight castle.
nl: %{skill} geeft de katapult van je held een extra schot en elk schot vernietigt automatisch elke muur, behalve een versterkte muur in een ridderkasteel.

source: %{skill} gives your hero a %{count} percent chance to learn any given 1st or 2nd level enemy spell used against him in a combat.
nl: %{skill} geeft je held een %{count} procent kans om een bepaalde vijandelijke spreuk van het 1e of 2e niveau te leren die tegen hem wordt gebruikt in een gevecht.

source: %{skill} gives your hero a %{count} percent chance to learn any given 3rd level spell (or below) used against him in combat.
nl: %{skill} geeft je held een %{count} procent kans om een bepaalde spreuk van het derde niveau (of lager) te leren die tegen hem wordt gebruikt in een gevecht.

source: %{skill} gives your hero a %{count} percent chance to learn any given 4th level spell (or below) used against him in combat.
nl: %{skill} geeft je held een %{count} procent kans om een bepaalde spreuk van het 4e niveau (of lager) te leren die tegen hem wordt gebruikt in een gevecht.

source: %{skill} allows %{count} percent of the creatures killed in combat to be brought back from the dead as Skeletons.
nl: %{skill} staat toe dat %{count} procent van de wezens die in gevechten zijn gedood, als skeletten uit de dood worden teruggebracht.

source: Your hero produces %{count} gold pieces per day as tax revenue from estates.
nl: Je held produceert %{count} goudstukken per dag als belastinginkomsten uit landgoederen.

source: Blue
nl: Blouw

source: Green
nl: Groen

source: Red
nl: Rood

source: Yellow
nl: Geel

source: Orange
nl: Oranje

source: Purple
nl: Paars

source: barrier|Aqua
nl: Aqua

source: barrier|Blue
nl: Blouw

source: barrier|Brown
nl: Bruin

source: barrier|Gold
nl: Goud

source: barrier|Green
nl: Groen

source: barrier|Orange
nl: Orangje

source: barrier|Purple
nl: Paars

source: barrier|Red
nl: Rood

source: tent|Aqua
nl: Aqua

source: tent|Blue
nl: Blouw

source: tent|Brown
nl: Bruin

source: tent|Gold
nl: Goud

source: tent|Green
nl: Groen

source: tent|Orange
nl: Orangje

source: tent|Purple
nl: Paars

source: tent|Red
nl: Rood

source: Experience
nl: Ervaring

source: Experience allows your heroes to go up levels, increasing their primary and secondary skills.
nl: Ervaring stelt je helden in staat om levels omhoog te gaan, waardoor hun primaire en secundaire vaardigheden toenemen.

source: Hero/Stats
nl: Held/Statistieken

source: Skills
nl: Vaardigheden

source: Artifacts
nl: Artefacts

source: Town/Castle
nl: Drop/Kasteel

source: Garrison
nl: Garnizoen

source: Gold Per Day:
nl: Goud per dag:

source: Heroes
nl: Helden

source: View Heroes.
nl: Bekijk Helden.

source: Towns/Castles
nl: Dorpen/Kastelen

source: View Towns and Castles.
nl: Bekijk Dorpen en Kastelen.

source: luck|Cursed
nl: Vervloekt

source: luck|Awful
nl: Vreselijk

source: luck|Bad
nl: Slecht

source: luck|Normal
nl: Normaal

source: luck|Good
nl: Goed

source: luck|Great
nl: Super Goed

source: luck|Irish
nl: Fantastisch

source: Bad luck sometimes falls on your armies in combat, causing their attacks to only do half damage.
nl: Pech valt soms op je legers in gevechten, waardoor hun aanvallen slechts halve schade aanrichten.

source: Neutral luck means your armies will never get lucky or unlucky attacks on the enemy.
nl: Neutraal geluk betekent dat je legers nooit gelukkige of ongelukkige aanvallen op de vijand zullen krijgen.

source: Good luck sometimes lets your armies get lucky attacks (double strength) in combat.
nl: Veel geluk laat je legers soms geluksaanvallen (dubbele sterkte) krijgen in gevechten.

source: morale|Treason
nl: Landverraad

source: morale|Awful
nl: Vreselijk

source: morale|Poor
nl: Slecht

source: morale|Normal
nl: Normaal

source: morale|Good
nl: Goed

source: morale|Great
nl: Super Goed

source: morale|Blood!
nl: Fantastisch!

source: Bad morale may cause your armies to freeze in combat.
nl: Een slecht moreel kan ervoor zorgen dat je legers bevriezen in de strijd.

source: Neutral morale means your armies will never be blessed with extra attacks or freeze in combat.
nl: Neutraal moreel betekent dat je legers nooit worden gezegend met extra aanvallen of bevriezen in gevechten.

source: Good morale may give your armies extra attacks in combat.
nl: Een goed moreel kan je legers extra aanvallen geven in gevechten.

source: Knight
nl: Ridder

source: Barbarian
nl: Barbaar

source: Sorceress
nl: Tovenares

source: Warlock
nl: Tovenaar

source: Wizard
nl: Tovenaar

source: Necromancer
nl: Geestenbezweerder

source: race|Random
nl: Willekurig

source: race|Neutral
nl: Neutraal

source: speed|Standing
nl: Staand

source: speed|Crawling
nl: Kruipend

source: speed|Very Slow
nl: Heel Sloom

source: speed|Slow
nl: Sloom

source: speed|Average
nl: Gemiddeld

source: speed|Fast
nl: Snel

source: speed|Very Fast
nl: Heel Snel

source: speed|Ultra Fast
nl: Super Snel

source: speed|Blazing
nl: Ontzettend Snel

source: speed|Instant
nl: Ongeloofelijk Snel

source: week|PLAGUE
nl: PLAAG

source: week|Ant
nl: Mier

source: week|Grasshopper
nl: Sprinkhaan

source: week|Dragonfly
nl: Libel

source: week|Spider
nl: Spin

source: week|Butterfly
nl: Vlinder

source: week|Bumblebee
nl: Bij

source: week|Locust
nl: Sprinkhaan

source: week|Earthworm
nl: Worm

source: week|Hornet
nl: Horzel

source: week|Beetle
nl: Kever

source: week|Squirrel
nl: Eekhorn

source: week|Rabbit
nl: Konijn

source: week|Gopher
nl: Gopher

source: week|Badger
nl: Das

source: week|Eagle
nl: Aadelaar

source: week|Weasel
nl: Wezel

source: week|Raven
nl: Raaf

source: week|Mongoose
nl: Mangoest

source: week|Aardvark
nl: Aardvarken

source: week|Lizard
nl: Hagedis

source: week|Tortoise
nl: Schildpad

source: week|Hedgehog
nl: Egel

source: week|Condor
nl: Condor

source: Desert
nl: Woestijn

source: Snow
nl: Sneeuw

source: Wasteland
nl: Woestenij

source: Beach
nl: Strand

source: Dirt
nl: Aarde

source: Grass
nl: Gras

source: Ocean
nl: Oceaan

source: maps|Small
nl: Klein

source: maps|Medium
nl: Gemiddeld

source: maps|Large
nl: Groot

source: maps|Extra Large
nl: Extra Groot

source: maps|Custom Size
nl: Aangepast

source: Ore Mine
nl: Ertsmijn

source: Sulfur Mine
nl: Zwavelmijn

source: Crystal Mine
nl: Kristalmijn

source: Gems Mine
nl: Edelsteenmijn

source: Gold Mine
nl: Goudmijn

source: Mine
nl: Mijn

source: Burma shave.
nl: Birma scheren.

source: Next sign 50 miles.
nl: Volgende bord 50 mijl.

source: See Rock City.
nl: Zie Rotsstad.

source: This space for rent.
nl: Deze plek is te huur.

source: No object
nl: Geen object

source: Daemon Cave
nl: Daemon-grot

source: Faerie Ring
nl: Elfen Ring

source: Dragon City
nl: Drakenstad

source: Lighthouse
nl: Vuurtoren

source: Water Wheel
nl: Waterrad

source: Mines
nl: Mijnen

source: Oasis
nl: Oase

source: Sawmill
nl: Zagerij

source: Oracle
nl: Orakel

source: Desert Tent
nl: Woestijn Tent

source: Wagon Camp
nl: Wagen Kamp

source: Windmill
nl: Windmolen

source: Random Town
nl: Willekurig Dorp

source: Random Castle
nl: Willekurig Kasteel

source: Watch Tower
nl: uitkijktoren

source: Tree City
nl: Bomen Stad

source: Tree House
nl: Boomhuis

source: Ruins
nl: Ruïnes

source: Abandoned Mine
nl: Verlaten mijn

source: Tree of Knowledge
nl: Boom van Kennis

source: Temple
nl: Tempel

source: Hill Fort
nl: Heuvel Fort

source: Halfling Hole
nl: Halflinggat

source: Mercenary Camp
nl: Huurlingenkamp

source: City of the Dead
nl: Stad van de doden

source: Troll Bridge
nl: Trollenbrug

source: Witch's Hut
nl: Heksenhut

source: Magellan's Maps
nl: Magellan's Kaarten

source: Derelict Ship
nl: Verlaten schip

source: Shipwreck
nl: Scheepswrak

source: Observation Tower
nl: Observatie toren

source: Watering Hole
nl: Waterput

source: Artesian Spring
nl: Artesische lente

source: Gazebo
nl: Prieel

source: Archer's House
nl: Boogschieter's Huis

source: Peasant Hut
nl: Boerenhut

source: Dwarf Cottage
nl: Dwerg huisje

source: Stone Liths
nl: Stenen Lichaamsdelen

source: Magic Well
nl: Magische Put

source: Sign
nl: Bord

source: Nothing Special
nl: Niets Speciaals

source: Tar Pit
nl: Teer Put

source: Mound
nl: Heuvel

source: Dune
nl: Duin

source: Stump
nl: Stomp

source: Trees
nl: Boomen

source: Dead Tree
nl: Dode Boom

source: Mountains
nl: Bergen

source: Volcano
nl: Vulkaan

source: Rock
nl: Steen

source: Flowers
nl: Bloemen

source: Water Lake
nl: Meer

source: Crater
nl: Krater

source: Lava Pool
nl: Lavabad

source: Shrub
nl: Struik

source: Buoy
nl: Boei

source: Skeleton
nl: Skelet

source: Treasure Chest
nl: Schatkist

source: Sea Chest
nl: Zeekist

source: Campfire
nl: Kampvuur

source: Fountain
nl: Fontijn

source: Genie Lamp
nl: Geesten Lamp

source: Goblin Hut
nl: Koboldenhut

source: Resource
nl: Bron

source: Whirlpool
nl: Draaikolk

source: Artifact
nl: Artefact

source: Boat
nl: Boot

source: Random Artifact
nl: Willekurig Artefact

source: Random Resource
nl: Willekurige Bron

source: Random Monster - weak
nl: Willekurig Monster - zwak

source: Random Monster - medium
nl: Willekurig Monster - gemiddeld

source: Random Monster - strong
nl: Willekurig Monster - sterk

source: Random Monster - very strong
nl: Willekurig Monster - heel sterk

source: Standing Stones
nl: Staande Stenen

source: Event
nl: Evenement

source: Random Monster
nl: Willekurig Monster

source: Random Ultimate Artifact
nl: Willekurig Ultiem Artefact

source: Idol
nl: Idool

source: Shrine of the First Circle
nl: Heiligdom van de eerste cirkel

source: Shrine of the Second Circle
nl: Heiligdom van de tweede cirkel

source: Shrine of the Third Circle
nl: Heiligdom van de derde cirkel

source: Wagon
nl: Wagen

source: Lean-To
nl: Afdak

source: Flotsam
nl: Zeedrift

source: Shipwreck Survivor
nl: Scheepsbruk Overlever

source: Bottle
nl: Fles

source: Magic Garden
nl: Magische Tuin

source: Random Artifact - Treasure
nl: Willekurig Artefact - Schat

source: Random Artifact - Minor
nl: Willekurig Artefact - Klein

source: Random Artifact - Major
nl: Willekurig Artefact - Grood

source: Jail
nl: Gevangenis

source: Traveller's Tent
nl: Reizigerstent

source: Barrier
nl: Barriere

source: Fire Summoning Altar
nl: Altaar voor vuuroproeping

source: Air Summoning Altar
nl: Altaar voor luchtoproeping

source: Earth Summoning Altar
nl: Altaar voor aardeoproeping

source: Water Summoning Altar
nl: Altaar voor wateroproeping

source: Barrow Mounds
nl: Grafheuvels

source: Stables
nl: Stallen

source: Alchemist's Tower
nl: De toren van de alchemist

source: Eye of the Magi
nl: Oog of the Magi

source: Mermaid
nl: Meermin

source: Sirens
nl: Sirenes

source: Reefs
nl: Riffen

source: Unknown Monster
nl: Onbekend Monster

source: Unknown Monsters
nl: Onbekende Monsters

source: Peasant
nl: Onderdaan

source: Peasants
nl: Onderdaanen

source: Archer
nl: Boogschutter

source: Archers
nl: Boogschutters

source: Pikemen
nl: Pikemanen

source: Veteran Pikeman
nl: Veteranen Pikeman

source: Veteran Pikemen
nl: Veteranen Pikemanen

source: Swordsman
nl: Zwaardvechter

source: Swordsmen
nl: Zwaardvechters

source: Master Swordsman
nl: Meester Zwaardvechter

source: Master Swordsmen
nl: Meester Zwaardvechters

source: Cavalries
nl: Cavalerie

source: Cavalry
nl: Cavalerie

source: Champion
nl: Champioen

source: Champions
nl: Champioenen

source: Paladin
nl: Paladijn

source: Paladins
nl: Paladijnen

source: Crusader
nl: Kruisvaarder

source: Crusaders
nl: Kruisvaarders

source: Goblin
nl: Kobold

source: Goblins
nl: Kobolden

source: Orcs
nl: Orks

source: Orc Chief
nl: Ork Chief

source: Orc Chiefs
nl: Ork Chiefs

source: Wolves
nl: Wolven

source: Ogres
nl: Ogren

source: Ogre Lord
nl: Ogre Lijder
