Repository: ihhub/fheroes2
Catalog: files/lang/*.po
Languages: nl

source: You've found some Medusas living in the ruins. They are willing to join your army for a price. Do you want to recruit Medusas?
nl: Je hebt wat Medusa's gevonden die in de ruïnes leven. Ze zijn bereid om zich tegen een prijs bij je leger aan te sluiten. Wil je Medusas rekruteren?

source: You've found a Sprite Tree City. Unfortunately, none of the Sprites living there wish to join an army. Maybe next week.
nl: Je hebt een Sprite Tree City gevonden. Helaas wil geen van de Sprites die daar wonen zich bij een leger aansluiten. Misschien volgende week.

source: Some of the Sprites living in the tree city are willing to join your army for a price. Do you want to recruit Sprites?
nl: Sommige Sprites die in de bomenstad wonen, zijn bereid om zich tegen een prijs bij je leger aan te sluiten. Wil je Sprites rekruteren?

source: A colorful Rogues' wagon stands empty here. Perhaps more Rogues will be here later.
nl: Een kleurrijke Rogues-wagen staat hier leeg. Misschien komen er later meer Rogues.

source: Distant sounds of music and laughter draw you to a colorful wagon housing Rogues. Do you wish to have any Rogues join your army?
nl: Verre geluiden van muziek en gelach trekken je naar een kleurrijke wagen met Rogues. Wil je dat er schurken in je leger komen?

source: A group of tattered tents, billowing in the sandy wind, beckons you. The tents are unoccupied. Perhaps more Nomads will be here later.
nl: Een groep gescheurde tenten, golvend in de zandige wind, wenkt je. De tenten zijn niet bezet. Misschien zullen er later meer Nomads zijn.

source: A group of tattered tents, billowing in the sandy wind, beckons you. Do you wish to have any Nomads join you during your travels?
nl: Een groep gescheurde tenten, golvend in de zandige wind, wenkt je. Wil je dat er Nomads bij je zijn tijdens je reizen?

source: The pit of mud bubbles for a minute and then lies still.
nl: De modderpoel borrelt even en ligt dan stil.

source: As you approach the bubbling pit of mud, creatures begin to climb out and position themselves around it. In unison they say: "Mother Earth would like to offer you a few of her troops. Do you want to recruit Earth Elementals?"
nl: Als je de borrelende modderpoel nadert, beginnen wezens eruit te klimmen en zich eromheen te positioneren. In koor zeggen ze: "Moeder Aarde wil je graag een paar van haar troepen aanbieden. Wil je Aardse Elementalen rekruteren?"

source: You enter the structure of white stone pillars, and find nothing.
nl: Je gaat de structuur van witte stenen pilaren binnen en vindt niets.

source: White stone pillars support a roof that rises up to the sky. As you enter the structure, the dead air of the outside gives way to a whirling gust that almost pushes you back out. The air current materializes into a barely visible form. The creature asks, in what can only be described as a loud whisper: "Why have you come? Are you here to call upon the forces of the air?"
nl: Witte stenen pilaren ondersteunen een dak dat oprijst naar de hemel. Als je de structuur betreedt, maakt de dode lucht van buiten plaats voor een wervelende windvlaag die je bijna weer naar buiten duwt. De luchtstroom materialiseert zich in een nauwelijks zichtbare vorm. Het wezen vraagt, in wat alleen kan worden omschreven als een luide fluistering: "Waarom ben je gekomen? Ben je hier om een beroep te doen op de krachten van de lucht?"

source: No Fire Elementals approach you from the lava pool.
nl: No Fire Elementals naderen je vanuit de lavapoel.

source: Beneath a structure that serves to hold in heat, Fire Elementals move about in a fiery pool of molten lava. A group of them approach you and offer their services. Would you like to recruit Fire Elementals?
nl: Onder een structuur die dient om warmte vast te houden, bewegen Vuur Elementalen zich in een vurige poel van gesmolten lava. Een groep van hen benadert u en biedt hun diensten aan. Wil je Fire Elementals rekruteren?

source: A face forms in the water for a moment, and then is gone.
nl: Even vormt zich een gezicht in het water en is dan weg.

source: Crystalline structures cast shadows over a small reflective pool of water. You peer into the pool, and a face that is not your own peers back. It asks: "Would you like to call upon the powers of water?"
nl: Kristallijne structuren werpen schaduwen over een kleine reflecterende plas water. Je tuurt in het zwembad, en een gezicht dat niet van jezelf is, tuurt terug. Het vraagt: "Wilt u een beroep doen op de krachten van het water?"

source: This burial site is deathly still.
nl: Deze begraafplaats is doodstil.

source: Restless spirits of long dead warriors seeking their final resting place offer to join you in hopes of finding peace. Do you wish to recruit ghosts?
nl: Rusteloze geesten van lang gedode krijgers die hun laatste rustplaats zoeken, bieden aan om zich bij je te voegen in de hoop vrede te vinden. Wil je geesten rekruteren?

source: The City of the Dead is empty of life, and empty of unlife as well. Perhaps some undead will move in next week.
nl: De Stad van de Doden is leeg van leven, en ook leeg van onleven. Misschien komen er volgende week een paar ondoden bij.

source: Some Liches living here are willing to join your army for a price. Do you want to recruit Liches?
nl: Sommige Liches die hier wonen, zijn bereid om zich tegen een prijs bij je leger aan te sluiten. Wil je Liches rekruteren?

source: You've found the ruins of an ancient city, now inhabited solely by the undead. Will you search?
nl: Je hebt de ruïnes gevonden van een oude stad, nu alleen bewoond door ondoden. Ga je zoeken?

source: Some of the surviving Liches are impressed by your victory over their fellows, and offer to join you for a price. Do you want to recruit Liches?
nl: Sommige van de overlevende Liches zijn onder de indruk van je overwinning op hun kameraden en bieden aan om tegen een prijs met je mee te doen. Wil je Liches rekruteren?

source: You've found one of those bridges that Trolls are so fond of living under, but there are none here. Perhaps there will be some next week.
nl: Je hebt een van die bruggen gevonden waar trollen zo graag onder leven, maar die zijn er hier niet. Misschien komt er volgende week nog wat.

source: Some Trolls living under a bridge are willing to join your army, but for a price. Do you want to recruit Trolls?
nl: Sommige trollen die onder een brug wonen, zijn bereid om zich bij je leger aan te sluiten, maar tegen een prijs. Wil je Trolls rekruteren?

source: Trolls living under the bridge challenge you. Will you fight them?
nl: Trollen die onder de brug leven, dagen je uit. Ga je tegen ze vechten?

source: A few Trolls remain, cowering under the bridge. They approach you and offer to join your forces as mercenaries. Do you want to buy any Trolls?
nl: Er zijn nog een paar trollen over, die onder de brug ineengedoken zitten. Ze benaderen je en bieden aan om je als huursoldaten te bundelen. Wil je Trolls kopen?

source: The Dragon city has no Dragons willing to join you this week. Perhaps a Dragon will become available next week.
nl: De Drakenstad heeft deze week geen Draken die met je mee willen doen. Wellicht komt er volgende week een Draak beschikbaar.

source: The Dragon city is willing to offer some Dragons for your army for a price. Do you wish to recruit Dragons?
nl: De Drakenstad is bereid om tegen een prijs wat Draken voor je leger aan te bieden. Wil je Draken rekruteren?

source: You stand before the Dragon City, a place off-limits to mere humans. Do you wish to violate this rule and challenge the Dragons to a fight?
nl: Je staat voor de Dragon City, een plek die niet toegankelijk is voor mensen. Wil je deze regel overtreden en de Draken uitdagen voor een gevecht?

source: Having defeated the Dragon champions, the city's leaders agree to supply some Dragons to your army for a price. Do you wish to recruit Dragons?
nl: Nadat ze de Drakenkampioenen hebben verslagen, komen de leiders van de stad overeen om tegen een prijs wat Draken aan je leger te leveren. Wil je Draken rekruteren?

source: From the observation tower, you are able to see distant lands.
nl: Vanaf de uitkijktoren kun je verre landen zien.

source: The spring only refills once a week, and someone's already been here this week.
nl: De veer wordt maar één keer per week bijgevuld, en deze week is hier al iemand geweest.

source: A drink at the spring is supposed to give you twice your normal spell points, but you are already at that level.
nl: Een drankje bij de bron zou je twee keer je normale spreukpunten moeten opleveren, maar je bent al op dat niveau.

source: A drink from the spring fills your blood with magic! You have twice your normal spell points in reserve.
nl: Een drankje uit de bron vult je bloed met magie! Je hebt twee keer je normale spreukpunten in reserve.

source: Recognizing you, the butler refuses to admit you. "The master," he says, "will not see the same student twice."
nl: De butler herkent u en weigert u toe te laten. "De meester," zegt hij, "zal dezelfde student niet twee keer zien."

source: The butler admits you to see the master of the house. He trains you in the four skills a hero should know.
nl: De butler geeft toe dat je de heer des huizes ziet. Hij traint je in de vier vaardigheden die een held moet kennen.

source: The butler opens the door and looks you up and down. "You are neither famous nor diplomatic enough to be admitted to see my master," he sniffs. "Come back when you think yourself worthy."
nl: De butler opent de deur en kijkt je van boven naar beneden. "Je bent niet beroemd en ook niet diplomatiek genoeg om toegelaten te worden tot mijn meester," snuift hij. "Kom terug als je denkt dat je het waard bent.

source: and
nl: en

source: All of the %{monsters} you have in your army have been trained by the battle masters of the fort. Your army now contains %{monsters2}.
nl: Alle %{monsters} die je in je leger hebt, zijn getraind door de gevechtsmeesters van het fort. Je leger bevat nu %{monsters2}.

source: An unusual alliance of Ogres, Orcs, and Dwarves offer to train (upgrade) any such troops brought to them. Unfortunately, you have none with you.
nl: Een ongebruikelijke alliantie van Ogres, Orcs en Dwarves biedt aan om dergelijke troepen te trainen (upgraden). Helaas heb je er geen bij je.

source: All of your %{monsters} have been upgraded into %{monsters2}.
nl: Al je %{monsters} zijn geüpgraded naar %{monsters2}.

source: A blacksmith working at the foundry offers to convert all Pikemen and Swordsmen's weapons brought to him from iron to steel. He also says that he knows a process that will convert Iron Golems into Steel Golems. Unfortunately, you have none of these troops in your army, so he can't help you.
nl: Een smid die bij de gieterij werkt, biedt aan om alle wapens van Pikemen en Swordsmen die hem zijn meegebracht van ijzer in staal om te zetten. Hij zegt ook dat hij een proces kent dat Iron Golems zal omzetten in Steel Golems. Helaas heb je geen van deze troepen in je leger, dus hij kan je niet helpen.

source: The captain looks at you with surprise and says: "You already have all the maps I know about. Let me fish in peace now."
nl: De kapitein kijkt je verbaasd aan en zegt: "Je hebt alle kaarten die ik ken al. Laat me nu rustig vissen."

source: A retired captain living on this refurbished fishing platform offers to sell you maps of the sea he made in his younger days for 1,000 gold. Do you wish to buy the maps?
nl: Een gepensioneerde kapitein die op dit gerenoveerde visplatform woont, biedt aan om je kaarten te verkopen van de zee die hij in zijn jonge dagen maakte voor 1.000 goud. Wenst u de kaarten te kopen?

source: The captain sighs. "You don't have enough money, eh? You can't expect me to give my maps away for free!"
nl: De kapitein zucht. "Je hebt niet genoeg geld, hè? Je kunt toch niet verwachten dat ik mijn kaarten gratis weggeef!\

source: You come upon an obelisk made from a type of stone you have never seen before. Staring at it intensely, the smooth surface suddenly changes to an inscription. The inscription is a piece of a lost ancient map. Quickly you copy down the piece and the inscription vanishes as abruptly as it appeared.
nl: Je komt een obelisk tegen die gemaakt is van een steensoort die je nog nooit eerder hebt gezien. Als je er intens naar kijkt, verandert het gladde oppervlak plotseling in een inscriptie. De inscriptie is een stuk van een verloren oude kaart. Snel kopieer je het stuk en de inscriptie verdwijnt even abrupt als het leek.

source: You have already been to this obelisk.
nl: Je bent al bij deze obelisk geweest.

source: Upon your approach, the tree opens its eyes in delight. "It is good to see you, my student. I hope my teachings have helped you."
nl: Bij uw nadering opent de boom zijn ogen in verrukking. "Het is goed je te zien, mijn student. Ik hoop dat mijn lessen je hebben geholpen."

source: Upon your approach, the tree opens its eyes in delight. "Ahh, an adventurer! Allow me to teach you a little of what I have learned over the ages."
nl: Bij uw nadering opent de boom zijn ogen in verrukking. "Ah, een avonturier! Sta me toe je een beetje te leren van wat ik door de eeuwen heen heb geleerd."

source: Upon your approach, the tree opens its eyes in delight.
nl: Bij uw nadering opent de boom zijn ogen in verrukking.

source: "Ahh, an adventurer! I will be happy to teach you a little of what I have learned over the ages for a mere %{count} %{res}."
nl: "Ah, een avonturier! Ik zal je graag een beetje leren van wat ik door de eeuwen heen heb geleerd voor slechts %{count} %{res}."

source: (Just bury it around my roots.)
nl: (Begraaf het gewoon rond mijn wortels.)

source: Tears brim in the eyes of the tree.
nl: Tranen springen in de ogen van de boom.

source: "I need %{count} %{res}."
nl: "Ik heb %{count} %{res} nodig."

source: it whispers. (sniff) "Well, come back when you can pay me."
nl: het fluistert. (snif) "Nou, kom maar terug als je me kunt betalen."

source: Nestled among the trees sits a blind seer. After you explain the intent of your journey, the seer activates his crystal ball, allowing you to see the strengths and weaknesses of your opponents.
nl: Genesteld tussen de bomen zit een blinde ziener. Nadat je de bedoeling van je reis hebt uitgelegd, activeert de ziener zijn kristallen bol, waardoor je de sterke en zwakke punten van je tegenstanders kunt zien.

source: The entrance to the cave is dark, and a foul, sulfurous smell issues from the cave mouth. Will you enter?
nl: De ingang van de grot is donker en er komt een vieze, zwavelachtige geur uit de grotmond. Ga je naar binnen?

source: You find a powerful and grotesque Demon in the cave. "Today," it rasps, "you will fight and surely die. But I will give you a choice of deaths. You may fight me, or you may fight my servants. Do you prefer to fight my servants?"
nl: Je vindt een krachtige en groteske Demon in de grot. "Vandaag," raspt het, "zul je vechten en zeker sterven. Maar ik zal je de keuze geven tussen doden. Je kunt tegen mij vechten, of je kunt tegen mijn dienaren vechten. Vecht je liever tegen mijn dienaren?"

source: Upon defeating the daemon's servants, you find a hidden cache with %{count} gold.
nl: Na het verslaan van de dienaren van de daemon, vind je een verborgen cache met %{count} goud.

source: The Demon screams its challenge and attacks! After a short, desperate battle, you slay the monster and receive %{exp} experience points.
nl: De Demon schreeuwt zijn uitdaging en valt aan! Na een korte, wanhopige strijd versla je het monster en ontvang je %{exp} ervaringspunten.

source: The Demon screams its challenge and attacks! After a short, desperate battle, you slay the monster and receive %{exp} experience points and %{count} gold.
nl: De Demon schreeuwt zijn uitdaging en valt aan! Na een korte, wanhopige strijd versla je het monster en ontvang je %{exp} ervaringspunten en %{count} goud.

source: The Demon screams its challenge and attacks! After a short, desperate battle, you slay the monster and find the %{art} in the back of the cave.
nl: De Demon schreeuwt zijn uitdaging en valt aan! Na een korte, wanhopige strijd, versla je het monster en vind je de %{art} achter in de grot.

source: The Demon leaps upon you and has its claws at your throat before you can even draw your sword. "Your life is mine," it says. "I will sell it back to you for %{count} gold."
nl: De demon springt op je af en heeft zijn klauwen op je keel voordat je zelfs maar je zwaard kunt trekken. "Jouw leven is van mij", staat er. "Ik verkoop het aan u terug voor %{count} goud."

source: Seeing that you do not have %{count} gold, the demon slashes you with its claws, and the last thing you see is a red haze.
nl: Aangezien je geen %{count} goud hebt, slaat de demon je met zijn klauwen en het laatste wat je ziet is een rode waas.

source: Except for evidence of a terrible battle, the cave is empty.
nl: Behalve het bewijs van een verschrikkelijke strijd, is de grot leeg.

source: As you enter the Alchemist's Tower, a hobbled, graying man in a brown cloak makes his way towards you.
nl: Als je de Alchemist's Tower binnengaat, komt er een strompelende, grijzende man in een bruine mantel naar je toe.

source: He checks your pack, and sees that you have 1 cursed item.
nl: Hij controleert je pack en ziet dat je 1 vervloekt item hebt.

source: For %{gold} gold, the alchemist will remove it for you. Do you pay?
nl: Voor %{gold} goud zal de alchemist het voor je verwijderen. Betaal je?

source: After you consent to pay the requested amount of gold, the alchemist grabs the cursed artifact and throws it into his magical cauldron.
nl: Nadat je ermee instemt om de gevraagde hoeveelheid goud te betalen, grijpt de alchemist het vervloekte artefact en gooit het in zijn magische ketel.

source: You hear a voice from behind the locked door, "You don't have enough gold to pay for my services."
nl: Je hoort een stem van achter de gesloten deur, "Je hebt niet genoeg goud om mijn diensten te betalen."

source: You hear a voice from high above in the tower, "Go away! I can't help you!"
nl: Je hoort een stem van hoog boven in de toren, "Ga weg! Ik kan je niet helpen!"

source: The head groom speaks to you, "That is a fine looking horse you have. I am afraid we can give you no better, but the horses your cavalry are riding look to be of poor breeding stock. We have many trained war horses which would aid your riders greatly. I insist you take them."
nl: De hoofdstalmeester zegt tegen je: "Dat is een mooi paard dat je hebt. Ik ben bang dat we je niet beter kunnen geven, maar de paarden die je cavalerie berijdt lijken van slechte fokdieren te zijn. We hebben veel getrainde oorlogspaarden die zou je ruiters enorm helpen. Ik sta erop dat je ze neemt."

source: As you approach the stables, the head groom appears, leading a fine looking war horse. "This steed will help speed you in your travels. Alas, he will grow tired in a week. You must also let me give better horses to your mounted soldiers, their horses look shoddy and weak."
nl: Als je de stallen nadert, verschijnt de hoofdgroom, die een mooi uitziend oorlogspaard leidt. "Dit ros zal je helpen om je reizen te versnellen. Helaas, hij zal binnen een week moe worden. Je moet me ook betere paarden laten geven aan je bereden soldaten, hun paarden zien er slordig en zwak uit."

source: The head groom approaches you and speaks, "You already have a fine horse, and have no inexperienced cavalry which might make use of our trained war horses."
nl: De hoofdstalmeester komt naar je toe en zegt: "Je hebt al een mooi paard en je hebt geen onervaren cavalerie die gebruik zou kunnen maken van onze getrainde oorlogspaarden."

source: As you approach the stables, the head groom appears, leading a fine looking war horse. "This steed will help speed you in your travels. Alas, his endurance will wane with a lot of heavy riding, and you must return for a fresh mount in a week. We also have many fine war horses which could benefit mounted soldiers, but you have none we can help."
nl: Als je de stallen nadert, verschijnt de hoofdgroom, die een mooi uitziend oorlogspaard leidt. "Dit ros zal u helpen uw reizen te versnellen. Helaas, zijn uithoudingsvermogen zal afnemen met veel zwaar rijden, en u moet binnen een week terugkeren voor een nieuw rijdier. We hebben ook veel mooie oorlogspaarden die van nut kunnen zijn voor bereden soldaten, maar je hebt er geen die we kunnen helpen."

source: The Arena guards turn you away.
nl: De bewakers van de Arena sturen je weg.

source: You have your crew stop up their ears with wax before the sirens' eerie song has any chance of luring them to a watery grave.
nl: Je laat je bemanning hun oren dichtstoppen met was voordat het angstaanjagende lied van de sirenes hen naar een waterig graf kan lokken.

source: As the sirens sing their eerie song, your small, determined army manages to overcome the urge to dive headlong into the sea.
nl: Terwijl de sirenes hun angstaanjagende lied zingen, weet je kleine, vastberaden leger de drang te overwinnen om halsoverkop de zee in te duiken.

source: An eerie wailing song emanates from the sirens perched upon the rocks. Many of your crew fall under its spell, and dive into the water where they drown. You are now wiser for the visit, and gain %{exp} experience.
nl: Een angstaanjagend gejammer klinkt uit de sirenes die op de rotsen zijn neergestreken. Veel van je bemanningsleden raken in de ban en duiken het water in waar ze verdrinken. U bent nu wijzer voor het bezoek en krijgt %{exp} ervaring.

source: In a dazzling display of daring, you break into the local jail and free the hero imprisoned there, who, in return, pledges loyalty to your cause.
nl: In een oogverblindend vertoon van durf breek je de plaatselijke gevangenis binnen en bevrijd je de held die daar gevangen zit, die in ruil daarvoor trouw belooft aan je zaak.

source: You already have %{count} heroes, and regretfully must leave the prisoner in this jail to languish in agony for untold days.
nl: Je hebt al %{count} helden, en helaas moet je de gevangene in deze gevangenis achterlaten om ontelbare dagen weg te kwijnen in doodsangst.

source: You enter a rickety hut and talk to the magician who lives there. He tells you of places near and far which may aid you in your journeys.
nl: Je gaat een gammele hut binnen en praat met de tovenaar die daar woont. Hij vertelt je over plaatsen dichtbij en ver weg die je kunnen helpen tijdens je reizen.

source: This eye seems to be intently studying its surroundings.
nl: Dit oog lijkt de omgeving aandachtig te bestuderen.

source: "I have a riddle for you," the Sphinx says. "Answer correctly, and you shall be rewarded. Answer incorrectly, and you shall be eaten. Do you accept the challenge?"
nl: "Ik heb een raadsel voor je," zegt de sfinx. "Antwoord correct, en je wordt beloond. Als je een fout antwoord geeft, wordt je opgegeten. Ga je de uitdaging aan?"

source: The Sphinx asks you the following riddle: '%{riddle}' Your answer?
nl: De Sfinx vraagt je het volgende raadsel: '%{riddle}' Jouw antwoord?

source: Looking somewhat disappointed, the Sphinx sighs. "You've answered my riddle so here's your reward. Now begone."
nl: De Sfinx kijkt enigszins teleurgesteld en zucht. "Je hebt mijn raadsel beantwoord, dus hier is je beloning. Ga nu weg."

source: "You guessed incorrectly," the Sphinx says, smiling. The Sphinx swipes at you with a paw, knocking you to the ground. Another blow makes the world go black, and you know no more.
nl: "Je hebt verkeerd geraden,", zegt de sfinx glimlachend. De Sfinx zwaait met een poot naar je en gooit je op de grond. Nog een klap maakt de wereld zwart en je weet niet meer.

source: You come across a giant Sphinx. The Sphinx remains strangely quiet.
nl: Je komt een gigantische Sfinx tegen. De Sfinx blijft vreemd stil.
