Repository: ihhub/fheroes2
Catalog: files/lang/*.po
Languages: nl

source: BATTLE ONLY
nl: ALLEEN VOOR GEVENCHTEN

source: GIFT
nl: CADEAU

source: MIN
nl: MINIMUM

source: DIFFICULTY
nl: MOEILIJKHEID

source: Warrior
nl: Strijder

source: Builder
nl: Bouwer

source: Explorer
nl: Ontdekker

source: None
nl: Geen

source: Warning
nl: Waarschuuwing

source: Do you want to regain control from AI? The effect will take place only on the next turn.
nl: Wil je controle terug nemen van de AI? Het effect neemt alleen plaats de volgende ronde.

source: A few %{monster}
nl: Een paar %{monster}

source: Several %{monster}
nl: Meerdere%{monster}

source: A pack of %{monster}
nl: Een groep van %{monster}

source: Lots of %{monster}
nl: Veel %{monster}

source: A horde of %{monster}
nl: Een horde van %{monster}

source: A throng of %{monster}
nl: Een menigte van %{monster}

source: A swarm of %{monster}
nl: Een zwerm van %{monster}

source: Zounds of %{monster}
nl: Zounden van %{monster}

source: A legion of %{monster}
nl: Een legioen van %{monster}

source: All %{race} troops +1
nl: Alle %{ras} troepen +1

source: Multiple
nl: Meerdere

source: Troops of %{count} alignments -%{penalty}
nl: Troepen van %{count} uitlijningen -%{penalty}

source: View %{name}
nl: Zie %{name}

source: Move the %{name}
nl: Beweeg de %{name}

source: Move or right click to redistribute %{name}
nl: Beweeg of rechter click om %{name} te herverdelen

source: Combine %{name} armies
nl: Combineer %{name} legers

source: Exchange %{name2} with %{name}
nl: Ruil %{name2} met %{name}

source: Select %{name}
nl: Selecteer %{name}

source: Cannot move last troop
nl: Kan laatste troep niet verplaatsen

source: Move the %{name}
nl: Verplaats de %{name}

source: Set Count
nl: Zet Tel

source: %{name} destroys half the enemy troops!
nl: %{name} vernietigd helft van de veihandelijke troepen!

source: %{name} has turned off the auto battle
nl: %{name} heeft de automatische wedstrijd uitgezet

source: %{name} has turned on the auto battle
nl: %{name} heeft de automatische wedstrijd aangezet!

source: Spell failed!
nl: Spreuk gefaald!

source: The Sphere of Negation artifact is in effect for this battle, disabling all combat spells.
nl: Het Sphere of Negation artefact is in effect voor deze wedstrijd, alle strijd spreuken zijn uitgeschakeld.

source: You have already cast a spell this round.
nl: Je hebt all een spreuk uitgesproken deze ronde.

source: That spell will affect no one!
nl: Die spreuk zal niemand beïnvloeden!

source: You may only summon one type of elemental per combat.
nl: Je kan maar 1 type van elemental oproepen per strijd.

source: There is no open space adjacent to your hero to summon an Elemental to.
nl: Er is geen open plek aangrenzend bij je held om een Elemental naar toe te oproepen.

source: The Moat reduces by -%{count} the defense skill of any unit and slows to half movement rate.
nl: De Moat verminderd by -%{count} de verdedgings vaardigheid van een eenheid en versloomt naar de helft van de bewegings snelheid

source: Speed
nl: Snelheid

source: Speed: %{speed}
nl: Snelheid: %{speed}

source: Army Order
nl: Legerorde

source: Auto Spell Casting
nl: Automatisch spreuk uitroepen

source: Grid
nl: Rooster

source: Shadow Movement
nl: Schaduw Beweging

source: Shadow Cursor
nl: Schaduw Cursor

source: Off
nl: Uit

source: On
nl: Aan

source: Set the speed of combat actions and animations.
nl: Zet de snelheid van gevechts acties en animaties.

source: Toggle to display army order during the battle.
nl: Schakel om het legerorde weer te geven tijdens het gevecht.

source: Toggle whether or not the computer will cast spells for you when auto combat is on. (Note: This does not affect spell casting for computer players in any way, nor does it affect quick combat.)
nl: Schakel wel of niet de computer spreuken voor je zal uitspreken waneer automatisch vechten aan staat. (Opmerking: Dit heeft geen invloed op spreuken uitspreken voor computer spelers hoe dan ook, het heeft ook geen invloed op snel vechten.)

source: Toggle the hex grid on or off. The hex grid always underlies movement, even if turned off. This switch only determines if the grid is visible.
nl: Schakel het hex raster aan of uit. Het hex raster onderlijnt altijd beweeging, even als uitgeschakeld. Deze schakel bepaalt alleen of het raster zichtbaar is.

source: Toggle on or off shadows showing where your creatures can move and attack.
nl: Schakel aan of uit of schaduwen worden weergegeven waar je schepsels kunnen bewegen en aanvallen.

source: Toggle on or off a shadow showing the current hex location of the mouse cursor.
nl: Schakel aan of uit een schaduw die de huidige hex-locatie van de muiscursor toont.

source: The enemy has surrendered!
nl: De vijand heeft zich overgegeven!

source: The enemy has fled!
nl: De vijand is gevlucht!

source: A glorious victory!
nl: Een glorieuze overwinning!

source: For valor in combat, %{name} receives %{exp} experience.
nl: Voor moed in de strijd, %{name} ontvangt %{exp} ervaring.

source: The cowardly %{name} flees from battle.
nl: De laffe %{name} vlucht voor de strijd.

source: %{name} surrenders to the enemy, and departs in shame.
nl: %{name} geeft zich over aan de vijand en vertrekt in schaamte.

source: Your force suffer a bitter defeat, and %{name} abandons your cause.
nl: Je strijdmacht lijdt een bittere nederlaag en %{name} geeft je zaak op.

source: Your force suffer a bitter defeat.
nl: Je strijdmacht lijdt een bittere nederlaag.

source: Battlefield Casualties
nl: Slachtoffers op het slagveld

source: Attacker
nl: Aanvaller

source: Defender
nl: Verdediger

source: As you reach for the %{name}, it mysteriously disappears.
nl: Als je naar de %{name} reikt, verdwijnt deze op mysterieuze wijze.

source: As your enemy reaches for the %{name}, it mysteriously disappears.
nl: Als je vijand naar de %{name} reikt, verdwijnt deze op mysterieuze wijze.

source: You have captured an enemy artifact!
nl: Je hebt een vijandelijk artefact gevangen!

source: Necromancy!
nl: Necromantie!

source: Practicing the dark arts of necromancy, you are able to raise %{count} of the enemy's dead to return under your service as %{monster}.
nl: Door de duistere kunst van necromantie te beoefenen, ben je in staat om %{count} van de vijandelijke doden te verhogen om terug te keren onder jouw dienst als %{monster}.

source: %{name} the %{race}
nl: %{name} de %{race}

source: Captain of %{name}
nl: Kapitein van %{name}

source: Attack
nl: Aanval

source: Defense
nl: Verdedig

source: Spell Power
nl: Spreuk Kracht

source: Knowledge
nl: Kennis

source: Morale
nl: Moreel

source: Luck
nl: Geluk

source: Spell Points
nl: Spreuk Punten

source: Hero's Options
nl: Held's Opties

source: Cast Spell
nl: Spreuk uitspreken

source: Retreat
nl: Terugtrekken

source: Surrender
nl: Overgave

source: Cancel
nl: Annuleren

source: Hero Screen
nl: Held Scherm

source: Captain's Options
nl: Kapitein's Opties

source: Cast a magical spell. You may only cast one spell per combat round. The round is reset when every creature has had a turn.
nl: Spreek een magische spruik uit. Je kan maar 1 spreuk uitspreken per gevechts ronde. De ronde resets waneer elk schepsel een beurt heeft gehad.

source: Retreat your hero, abandoning your creatures. Your hero will be available for you to recruit again, however, the hero will have only a novice hero's forces.
nl: Trek je held terug en laat je schepsels in de steek. Je held zal beschikbaar zijn om opnieuw te rekruteren, maar de held zal alleen de troepen van een beginnende held hebben.

source: Surrendering costs gold. However if you pay the ransom, the hero and all of his or her surviving creatures will be available to recruit again.
nl: Overgave kost geld. Echter als je het losgeld betaalt zal de held en al van de overlevende schepsels beschikbaar zijn om opnieuw te rekruteren.

source: Open Hero Screen to view full information about the hero.
nl: Open het heldenscherm om volledige informatie over de held te bekijken.

source: Return to the battle.
nl: Keer terug naar de strijd.

source: Not enough gold (%{gold})
nl: Niet genoeg gound (%{gold})

source: %{name} states:
nl: %{name} staat:

source: Captain of %{name} states:
nl: De Kapitein van %{name} staat:

source: "I will accept your surrender and grant you and your troops safe passage for the price of %{price} gold."
nl: "Ik zal je overgave accepteren en jou en je troepen een veilige doorgang geven voor de prijs van %{price} goud."

source: View %{monster} info
nl: Bekijk de info van %{monster}

source: Shoot %{monster}
nl: Schiet %{monster}

source: (1 shot left)
nl: (1 schot over)

source: Attack %{monster}
nl: Val %{monster} aan

source: Fly %{monster} here
nl: Vlieg %{monster} hier

source: Move %{monster} here
nl: Beweeg %{monster} hier

source: Turn %{turn}
nl: Draai %{turn}

source: Teleport here
nl: Teleporteer hier

source: Invalid teleport destination
nl: Ongeldige teleporteers bestemming

source: Cast %{spell} on %{monster}
nl: %{spell} uitgesproken op %{monster}

source: Cast %{spell}
nl: %{spell} uitspreken

source: Select spell target
nl: Selecteer spreuk doelwit

source: View Ballista info
nl: Ballista-info bekijken

source: Enable auto combat
nl: Automatische gevechten inschakelen

source: Allows the computer to fight out the battle for you.
nl: Hiermee kan de computer de strijd voor je uitvechten.

source: Auto Combat
nl: Automatisch Vechten

source: Customize system options
nl: Systeem instellingen aanpassen

source: Allows you to customize the combat screen.
nl: Hiermee kan je het gevechts scherm aanpassen

source: System Options
nl: Systeem Instellingen

source: Wait this unit
nl: Wacht deze eenheid

source: Wait
nl: Wacht

source: Waits the current creature. The current creature delays its turn until after all other creatures have had their turn.
nl: Wacht op het huidige schepsel. Het huidige schepsel stelt zijn beurt uit tot alle andere schepsels aan de beurt zijn geweest.

source: Skip this unit
nl: Deze eenheid overslaan

source: Skip
nl: Overslaan

source: Skips the current creature. The current creature ends its turn and does not get to go again until the next round.
nl: Slaat het huidige schepsel over. Het huidige schepsel eindigt zijn beurt en

source: View Captain's options
nl: Bekijk Kapitein's opties

source: View Hero's options
nl: Bekijk Held's opties

source: View opposing Captain
nl: Bekijk tegenstander Kapitein

source: View opposing Hero
nl: Bekijk tegenstander Held

source: Hide logs
nl: Logboeken verbergen

source: Show logs
nl: Logboeken weergeven

source: Message Bar
nl: Brichtenbalk

source: Shows the results of individual monster's actions.
nl: Toont de resultaten van de acties van individuele monsters.

source: Are you sure you want to finish the battle in auto mode?
nl: Weet je zeker dat je het gevecht in de automatische modus wilt beëindigen?

source: %{name} skip their turn.
nl: %{name} slaat zijn beurt over.

source: %{name} wait their turn.
nl: %{name} wacht op hun beurt

source: %{attacker} does %{damage} damage.
nl: %{attacker} doet %{damage} schade.

source: 1 creature perishes.
nl: 1 schepsel vergaat.

source: 1 %{defender} perishes.
nl: 1 %{defender} vergaat.

source: Moved %{monster}: from [%{src}] to [%{dst}].
nl: Bewoog %{monster}: van [%{src}] naar [%{dst}]

source: The %{name} resist the spell!
nl: De %{name} weerstaat de spreuk!

source: %{name} casts %{spell} on the %{troop}.
nl: %{name} spreekt %{spell} uit op %{troop}.

source: %{name} casts %{spell}.
nl: %{name} spreekt %{spell}.

source: The %{spell} does %{damage} damage to one undead creature.
nl: De %{spell} doet %{damage} schade aan een ondode schepsel.

source: The %{spell} does %{damage} damage to all undead creatures.
nl: De %{spell} richt %{damage} schade aan aan alle ondode schepsels.

source: The %{spell} does %{damage} damage, %{count} creatures perish.
nl: De %{spell} richt %{damage} schade aan, %{count} schepsels komen om.

source: The %{spell} does %{damage} damage.
nl: De %{spell} richt %{damage} schade aan.

source: The %{spell} does %{damage} damage to one living creature.
nl: De %{spell} richt %{damage} schade aan aan 1 levend schepsel.

source: The %{spell} does %{damage} damage to all living creatures.
nl: De %{spell} richt %{damage} schade aan aan alle levende schepsels.

source: The %{attacker}' attack blinds the %{target}!
nl: De aanval van %{attacker} verblindt de %{target}!

source: The %{attacker}' gaze turns the %{target} to stone!
nl: De blik van de %{attacker} verandert het %{target} in steen!

source: The %{attacker}' curse falls upon the %{target}!
nl: De vloek van de %{attacker} valt op de %{target}!

source: The %{target} are paralyzed by the %{attacker}!
nl: De %{target} zijn verlamd door de %{attacker}!

source: The %{attacker} dispel all good spells on your %{target}!
nl: De %{attacker} verdrijft alle goede spreuken op je %{target}!

source: The %{attacker} cast %{spell} on %{target}!
nl: De %{attacker} spreekt %{spell} uit op %{target}!

source: Bad luck descends on the %{attacker}.
nl: Pech komt neer op de %{attacker}.

source: Good luck shines on the %{attacker}.
nl: Geluk komt neer op de %{attacker}

source: High morale enables the %{monster} to attack again.
nl: Een hoog moreel stelt het %{monster} in staat opnieuw aan te vallen.

source: Low morale causes the %{monster} to freeze in panic.
nl: Een laag moreel zorgt ervoor dat het %{monster} in paniek bevriest.

source: %{tower} does %{damage} damage.
nl: %{tower} doet %{damage} schade.

source: The mirror image is created.
nl: Het spiegelbeeld wordt gecreëerd.

source: The mirror image is destroyed!
nl: Het spiegelbeeld is vernietigd!

source: Error
nl: Fout

source: No spells to cast.
nl: Geen spreuken om uit te spreken.

source: Are you sure you want to retreat?
nl: Weet je zeker dat je je wilt terugtrekken?

source: Retreat disabled
nl: Terugtrekken uitgeschakeld

source: Surrender disabled
nl: Overgave uitgeschakeld

source: Damage: %{max}
nl: Schade: %{max}

source: Damage: %{min} - %{max}
nl: Schade: %{min} - %{max}

source: Perish: %{max}
nl: Vergaan: %{max}

source: Perish: %{min} - %{max}
nl: Vergaan: %{min} - %{max}

source: Through eagle-eyed observation, %{name} is able to learn the magic spell %{spell}.
nl: Door observatie met arendsogen kan %{name} de magische spreuk %{spell} leren.

source: Human
nl: Mens

source: AI
nl: Computer

source: Please select another hero.
nl: Selecteer een andere held.

source: Set Attack Skill
nl: Aanvalsvaardigheid instellen

source: Set Defense Skill
nl: Verdedigingsvaardigheid instellen

source: Set Power Skill
nl: Krachtsvaardigheid instellen

source: Set Knowledge Skill
nl: Kennisvaardigheid instellen

source: vs
nl: tegen

source: N/A
nl: Nvt

source: Left Turret
nl: Linker torentje

source: Right Turret
nl: Rechter torentje

source: The %{name} fires with the strength of %{count} Archers
nl: De %{name} vuurt met de kracht van %{count} Boogschutters

source: each with a +%{attack} bonus to their attack skill.
nl: elk met een +%{attack} bonus voor hun aanvalsvaardigheid.

source: The %{artifact} artifact is in effect for this battle, disabling %{spell} spell.
nl: Het %{artefact}-artefact is van kracht voor dit gevecht, waardoor de %{spell}-spreuk wordt uitgeschakeld.

source: %{count} %{name} rise(s) from the dead!
nl: %{count} %{name} opstaan uit de dood!

source: Dwarven Alliance
nl: Dwergen Alliantie

source: Sorceress Guild
nl: Tovenares Gilde

source: Necromancer Guild
nl: Necromancer gilde

source: Ogre Alliance
nl: Ogre Alliantie

source: Dwarfbane
nl: Poortwachter

source: Dragon Alliance
nl: Draken Alliantie

source: Elven Alliance
nl: Elven Alliantie

source: Kraeger defeated
nl: Kraeger verslagen

source: Wayward Son
nl: Wayward zoon

source: Uncle Ivan
nl: Oom Ivan

source: Annexation
nl: Annexatie

source: Carator Mines
nl: Caratormijnen

source: Force of Arms
nl: Kracht van Wapens

source: Save the Dwarves
nl: Red de Dwarfen

source: The Crown
nl: De Kroon

source: The Gauntlet
nl: De Handschoen

source: Turning Point
nl: Draai Punt

source: Betrayal
nl: Bedrog

source: Corlagon's Defense
nl: Corlagons Verdediging

source: Final Justice
nl: Laatste Gerechtigheid

source: Roland needs you to defeat the lords near his castle to begin his war of rebellion against his brother. They are not allied with each other, so they will spend most of their time fighting with one another. Victory is yours when you have defeated all of their castles and heroes.
nl: Roland heeft je nodig om de heren in de buurt van zijn kasteel te verslaan om zijn rebellie tegen zijn broer te beginnen. Ze zijn niet met elkaar verbonden, dus zullen ze het grootste deel van hun tijd met elkaar vechten. De overwinning is van jou als je al hun kastelen en helden hebt verslagen.

source: The local lords refuse to swear allegiance to Roland, and must be subdued. They are wealthy and powerful, so be prepared for a tough fight. Capture all enemy castles to win.
nl: De lokale heren weigeren trouw te zweren aan Roland en moeten worden onderworpen. Ze zijn rijk en machtig, dus wees voorbereid op een zwaar gevecht. Verover alle vijandelijke kastelen om te winnen.

source: Your task is to defend the Dwarves against Archibald's forces. Capture all of the enemy towns and castles to win, and be sure not to lose all of the dwarf towns at once, or the enemy will have won.
nl: Jouw taak is om de Dwergen te verdedigen tegen de troepen van Archibald. Verover alle vijandige steden en kastelen om te winnen, en zorg ervoor dat je niet alle dwergsteden in één keer verliest, anders heeft de vijand gewonnen.

source: You will face four allied enemies in a straightforward fight for resource and treasure. Capture all of the enemy castles for victory.
nl: Je neemt het op tegen vier geallieerde vijanden in een ongecompliceerd gevecht om grondstoffen en schatten. Verover alle vijandelijke kastelen voor de overwinning.

source: Your enemies are allied against you and start close by, so be ready to come out fighting. You will need to own all four castles in this small valley to win.
nl: Je vijanden zijn tegen je geallieerd en beginnen dichtbij, dus wees klaar om te vechten. Je moet alle vier de kastelen in deze kleine vallei bezitten om te winnen.

source: The Sorceress' guild of Noraston has requested Roland's aid against an attack from Archibald's allies. Capture all of the enemy castles to win, and don't lose Noraston, or you'll lose the scenario. (Hint: There is an enemy castle on an island in the ocean.)
nl: Het Tovenaarsgilde van Noraston heeft Roland om hulp gevraagd tegen een aanval van Archibalds bondgenoten. Verover alle vijandelijke kastelen om te winnen, en verlies Noraston niet, anders verlies je het scenario. (Hint: er is een vijandelijk kasteel op een eiland in de oceaan.)

source: Gather as large an army as possible and capture the enemy castle within 8 weeks. You are opposed by only one enemy, but must travel a long way to get to the enemy castle. Any troops you have in your army at the end of this scenario will be with you in the final battle.
nl: Verzamel een zo groot mogelijk leger en verover het vijandelijke kasteel binnen 8 weken. Je wordt tegengewerkt door slechts één vijand, maar je moet een lange weg afleggen om bij het vijandelijke kasteel te komen. Alle troepen die je aan het einde van dit scenario in je leger hebt, zullen bij je zijn in het laatste gevecht.

source: Find the Crown before Archibald's heroes find it. Roland will need the Crown for the final battle against Archibald.
nl: Vind de kroon voordat de helden van Archibald hem vinden. Roland heeft de Kroon nodig voor het laatste gevecht tegen Archibald.

source: Three allied enemies stand before you and victory, including Lord Corlagon. Roland is in a castle to the northwest, and you will lose if he falls to the enemy. Remember that capturing Lord Corlagon will ensure that he will not fight against you in the final scenario.
nl: Drie geallieerde vijanden staan voor je en zegevieren, waaronder Lord Corlagon. Roland bevindt zich in een kasteel in het noordwesten en je zult verliezen als hij door de vijand valt. Onthoud dat het vangen van Lord Corlagon ervoor zal zorgen dat hij niet tegen je zal vechten in het laatste scenario.

source: This is the final battle. Both you and your enemy are armed to the teeth, and all are allied against you. Capture Archibald to end the war!
nl: Dit is de laatste strijd. Zowel jij als je vijand zijn tot de tanden bewapend, en ze zijn allemaal tegen je geallieerd. Vang Archibald om de oorlog te beëindigen!

source: Switching sides leaves you with three castles against the enemy's one. This battle will be the easiest one you will face for the rest of the war...traitor.
nl: Als je van kant wisselt, krijg je drie kastelen tegen die van de vijand. Deze strijd zal de gemakkelijkste zijn die je de rest van de oorlog zult tegenkomen... verrader.

source: Barbarian Wars
nl: Barbaarse Oorlogen

source: First Blood
nl: Eerste Bloed

source: Slay the Dwarves
nl: Versla de Dwergen

source: Country Lords
nl: Landheren

source: Dragon Master
nl: Draken Meester

source: Rebellion
nl: Opstand

source: Greater Glory
nl: Grotere Glorie

source: King Archibald requires you to defeat the three enemies in this region. They are not allied with one another, so they will spend most of their energy fighting amongst themselves. You will win when you own all of the enemy castles and there are no more heroes left to fight.
nl: King Archibald vereist dat je de drie vijanden in deze regio verslaat. Ze zijn niet met elkaar verbonden, dus zullen ze het grootste deel van hun energie onder elkaar vechten. Je wint als je alle vijandelijke kastelen bezit en er geen helden meer zijn om tegen te vechten.

source: You must unify the barbarian tribes of the north by conquering them. As in the previous mission, the enemy is not allied against you, but they have more resources at their disposal. You will win when you own all of the enemy castles and there are no more heroes left to fight.
nl: Je moet de barbaarse stammen van het noorden verenigen door ze te veroveren. Net als in de vorige missie is de vijand niet geallieerd tegen jou, maar hebben ze meer middelen tot hun beschikking. Je wint als je alle vijandelijke kastelen bezit en er geen helden meer zijn om tegen te vechten.

source: Do-gooder wizards have taken the Necromancers' castle. You must retake it to achieve victory. Remember that while you start with a powerful army, you have no castle and must take one within 7 days, or lose this battle. (Hint: The nearest castle is to the southeast.)
nl: Weldoener tovenaars hebben het kasteel van de Necromancers ingenomen. Je moet het heroveren om de overwinning te behalen. Onthoud dat terwijl je begint met een machtig leger, je geen kasteel hebt en er binnen 7 dagen een moet veroveren, anders verlies je deze strijd. (Hint: het dichtstbijzijnde kasteel ligt in het zuidoosten.)

source: The dwarves need conquering before they can interfere in King Archibald's plans. Roland's forces have more than one hero and many towns to start with, so be ready for attack from multiple directions. You must capture all of the enemy towns and castles to claim victory.
nl: De dwergen moeten worden overwonnen voordat ze zich kunnen bemoeien met de plannen van koning Archibald. Rolands strijdkrachten hebben om te beginnen meer dan één held en veel steden, dus wees voorbereid op aanvallen vanuit meerdere richtingen. Je moet alle vijandige steden en kastelen veroveren om de overwinning te claimen.
