Repository: ihhub/fheroes2
Catalog: files/lang/*.po
Languages: nl

source: You must put down a peasant revolt led by Roland's forces. All are allied against you, but you have Lord Corlagon, an experienced hero, to help you. Capture all enemy castles to win.
nl: Je moet een boerenopstand neerslaan onder leiding van Rolands troepen. Ze zijn allemaal tegen je geallieerd, maar je hebt Lord Corlagon, een ervaren held, om je te helpen. Verover alle vijandelijke kastelen om te winnen.

source: There are two enemies allied against you in this mission. Both are well armed and seek to evict you from their island. Avoid them and capture Dragon City to win.
nl: zijn goed bewapend en proberen je van hun eiland te verdrijven. Ontwijk ze en verover Dragon City om te winnen.

source: Your orders are to conquer the country lords that have sworn to serve Roland. All of the enemy castles are unified against you. Since you start without a castle, you must hurry to capture one before the end of the week. Capture all enemy castles for victory.
nl: Jouw orders zijn om de landheren te veroveren die gezworen hebben om Roland te dienen. Alle vijandige kastelen zijn tegen je verenigd. Aangezien je zonder kasteel begint, moet je je haasten om er voor het einde van de week een te veroveren. Verover alle vijandelijke kastelen voor de overwinning.

source: Find the Crown before Roland's heroes find it. Archibald will need the Crown for the final battle against Roland.
nl: Vind de kroon voordat de helden van Roland hem vinden. Archibald heeft de Kroon nodig voor het laatste gevecht tegen Roland.

source: This is the final battle. Both you and your enemy are armed to the teeth, and all are allied against you. Capture Roland to win the war, and be sure not to lose Archibald in the fight!
nl: Dit is de laatste strijd. Zowel jij als je vijand zijn tot de tanden bewapend, en ze zijn allemaal tegen je geallieerd. Leg Roland vast om de oorlog te winnen en zorg ervoor dat je Archibald niet verliest in het gevecht!

source: Arrow's Flight
nl: De vlucht van Arrow

source: Island of Chaos
nl: Eiland van Chaos

source: The Abyss
nl: De Afgrond

source: Uprising
nl: Opstand

source: Aurora Borealis
nl: Noorderlicht

source: Betrayal's End
nl: Het einde van verraad

source: Corruption's Heart
nl: Het hart van corruptie

source: The Giant's Pass
nl: De Reuzenpas

source: Subdue the unruly local lords in order to provide the Empire with facilities to operate in this region.
nl: Onderwerp de weerbarstige lokale heren om het rijk te voorzien van faciliteiten om in deze regio te opereren.

source: Eliminate all oposition in this area. Then the first piece of the artifact will be yours.
nl: Elimineer alle oppositie op dit gebied. Dan is het eerste stuk van het artefact van jou.

source: The sorceresses to the northeast are rebelling! For the good of the empire you must quash their feeble uprising on your way to the mountains.
nl: De tovenaressen in het noordoosten komen in opstand! Voor het welzijn van het rijk moet je hun zwakke opstand neerslaan op weg naar de bergen.

source: Having prepared for your arrival, Kraeger has arranged for a force of necromancers to thwart your quest. You must capture the castle of Scabsdale before the first day of the third week, or the Necromancers will be too strong for you.
nl: Kraeger heeft zich voorbereid op je komst en heeft een leger van necromancers geregeld om je zoektocht te dwarsbomen. Je moet het kasteel van Scabsdale veroveren voor de eerste dag van de derde week, anders zijn de Necromancers te sterk voor je.

source: The barbarian despot in this area is, as yet, ignorant of your presence. Quickly, build up your forces before you are discovered and attacked! Secure the region by subduing all enemy forces.
nl: De barbaarse despoot in dit gebied is nog niet op de hoogte van je aanwezigheid. Bouw snel je troepen op voordat je ontdekt en aangevallen wordt! Beveilig de regio door alle vijandelijke troepen te onderwerpen.

source: The Empire is weak in this region. You will be unable to completely subdue all forces in this area, so take what you can before reprisal strikes. Remember, your true goal is to claim the Helmet of Anduran.
nl: Het rijk is zwak in deze regio. Je zult niet in staat zijn om alle troepen in dit gebied volledig te bedwingen, dus pak wat je kunt voordat represailles toeslaan. Onthoud dat je echte doel is om de Helm van Anduran te claimen.

source: For the good of the Empire, eliminate Kraeger.
nl: Schakel Kraeger uit voor het welzijn van het rijk.

source: At last, you have the opportunity and the facilities to rid the Empire of the necromancer's evil. Eradicate them completely, and you will be sung as a hero for all time.
nl: Eindelijk heb je de kans en de faciliteiten om het rijk te verlossen van het kwaad van de necromancer. Als je ze volledig uitroeit, word je voor altijd als een held bezongen.

source: Border Towns
nl: Grenssteden

source: Conquer and Unify
nl: Verover en verenig

source: Crazy Uncle Ivan
nl: Gekke Oom Ivan

source: The Wayward Son
nl: De Eigenzinnige Zoon

source: Ivory Gates
nl: Ivoren Poorten

source: The Elven Lands
nl: De Elfen Landen

source: The Epic Battle
nl: De Epische Strijd

source: The Southern War
nl: De Zuidelijke Oorlog

source: Conquer and unite all the enemy tribes. Don't lose the hero Jarkonas, the forefather of all descendants.
nl: Verover en verenig alle vijandige stammen. Verlies de held Jarkonas niet, de voorvader van alle nakomelingen.

source: Your rival, the Kingdom of Harondale, is attacking weak towns on your border! Recover from their first strike and crush them completely!
nl: Je rivaal, het koninkrijk Harondale, valt zwakke steden aan je grens aan! Herstel van hun eerste aanval en verpletter ze volledig!

source: Find your wayward son Joseph who is rumored to be living in the desolate lands. Do it before the first day of the third month or it will be of no help to your family.
nl: Vind je eigenzinnige zoon Joseph, van wie wordt gezegd dat hij in de verlaten landen woont. Doe het voor de eerste dag van de derde maand, anders heeft je gezin er niets aan.

source: Rescue your crazy uncle Ivan. Find him before the first day of the fourth month or it will be no help to your kingdom.
nl: Red je gekke oom Ivan. Vind hem voor de eerste dag van de vierde maand of het zal je koninkrijk niet helpen.

source: Destroy the barbarians who are attacking the southern border of your kingdom! Recover your fallen towns, and then invade the jungle kingdom. Leave no enemy standing.
nl: Vernietig de barbaren die de zuidelijke grens van je koninkrijk aanvallen! Herstel je gevallen steden en val dan het junglekoninkrijk binnen. Laat geen vijand staan.

source: Retake the castle of Ivory Gates, which has fallen due to treachery.
nl: Herover het kasteel van Ivory Gates, dat door verraad is gevallen.

source: Gain the favor of the elves. They will not allow trees to be chopped down, so they will send you wood every 2 weeks. You must complete your mission before the first day of the seventh month, or the kingdom will surely fall.
nl: Win de gunst van de elfen. Ze laten niet toe dat bomen worden gekapt, dus sturen ze je elke 2 weken hout. Je moet je missie voltooien vóór de eerste dag van de zevende maand, anders zal het koninkrijk zeker vallen.

source: This is the final battle against your rival kingdom of Harondale. Eliminate everyone, and don't lose the hero Jarkonas VI.
nl: Dit is de laatste strijd tegen je rivaliserende koninkrijk Harondale. Schakel iedereen uit en verlies de held Jarkonas VI niet.

source: Fount of Wizardry
nl: Bron van Tovenarij

source: Power's End
nl: Einde van de macht

source: The Eternal Scrolls
nl: De Eeuwige Rollen

source: The Shrouded Isles
nl: De Gehulde Eilanden

source: Your mission is to vanquish the warring mages in the magical Shrouded Isles. The completion of this task will give you a fighting chance against your rivals.
nl: Jouw missie is om de strijdende magiërs op de magische Shrouded Isles te verslaan. De voltooiing van deze taak geeft je een vechtkans tegen je rivalen.

source: The location of the great library has been discovered! You must make your way to it, and reclaim the city of Chronos in which it lies.
nl: De locatie van de grote bibliotheek is ontdekt! Je moet je weg ernaartoe vinden en de stad Chronos waarin het ligt terugwinnen.

source: Find the Orb of negation, which is said to be buried in this land. There are clues inscribed on stone obelisks which will help lead you to your price. Find the orb before the first day of the sixth month, or your rivals will surely have gotten to the fount before you.
nl: Vind de bol van ontkenning, waarvan wordt gezegd dat deze in dit land begraven ligt. Er zijn aanwijzingen op stenen obelisken gegraveerd die u naar je prijs zullen leiden. Vind de bol vóór de eerste dag van de zesde maand, anders zullen je rivalen zeker de bron voor je hebben bereikt.

source: You must take control of the castle of Magic, where the fount of wizardry lies. Do this and your victory will be supreme.
nl: Je moet het kasteel van Magic overnemen, waar de bron van tovenarij ligt. Doe dit en je overwinning zal oppermachtig zijn.

source: Blood is Thicker
nl: Bloed is Dikker

source: King and Country
nl: Koning en Land

source: Pirate Isles
nl: Pirateneilanden

source: Stranded
nl: Gestrand

source: Capture the town on the island off the southeast shore in order to construct a boat and travel back towards the mainland. Do not lose the hero Gallavant.
nl: Verover de stad op het eiland voor de zuidoostkust om een boot te bouwen en terug te reizen naar het vasteland. Verlies de held Gallavant niet.

source: Find and defeat Martine, the pirate leader, who resides in Pirates Cove. Do not lose Gallavant or your quest will be over.
nl: Vind en versla Martine, de piratenleider, die in Pirates Cove woont. Verlies Gallavant niet, anders is je zoektocht voorbij.

source: Eliminate all the other forces who oppose the rule of Lord Alberon. Gallavant must not die.
nl: Schakel alle andere krachten uit die zich verzetten tegen de heerschappij van Lord Alberon. Gallavant mag niet sterven.

source: Overthrow the entrenched monarchy of Lord Alberon, and claim all the land in your name. Gallavant must not die.
nl: Omver de diepgewortelde monarchie van Lord Alberon en claim al het land in je naam. Gallavant mag niet sterven.

source: bane
nl: vloek

source: alliance
nl: alliantie

source: Carry-over forces
nl: Overdrachtskrachten

source: defeated
nl: verslagen

source: will always run away from your army.
nl: zal altijd wegrennen van je leger.

source: will be willing to join your army.
nl: zal bereid zijn om zich bij je leger aan te sluiten..

source: "%{artifact}" artifact will be carried over the scenario.
nl: "%{artifact}" artefact zal over het scenario worden overgedragen.

source: The army will be carried over the scenario.
nl: Het leger zal het scenario overnemen.

source: The kingdom will have +%{count} %{resource} each day.
nl: Het koninkrijk zal elke dag +%{count} %{resource} hebben.

source: "%{spell}" spell will be carried over the scenario.
nl: De spreuk "%{spell}" wordt over het scenario overgedragen.

source: %{hero} can be hired in the scenario.
nl: %{hero} kan worden ingehuurd in het scenario.

source: %{hero} has been defeated and will not appear in the subsequent scenarios.
nl: %{hero} is verslagen en zal niet verschijnen in de volgende scenario's.

source: The dwarves recognize their allies and gladly join your forces.
nl: De dwergen herkennen hun bondgenoten en sluiten zich graag bij je aan.

source: The ogres recognize you as the Dwarfbane and lumber over to join you.
nl: De ogres herkennen je als de Dwergbane en sjokken naar je toe.

source: The dragons, snarling and growling, agree to join forces with you, their 'Ally'.
nl: De draken komen grommend en grommend overeen om hun krachten te bundelen

source: As you approach the group of elves, their leader calls them all to attention. He shouts to them, "Who of you is brave enough to join this fearless ally of ours?" The group explodes with cheers as they run to join your ranks.
nl: Als je de groep elfen nadert, roept hun leider ze allemaal onder de aandacht. Hij roept naar hen: 'Wie van jullie is dapper genoeg om zich bij deze onverschrokken bondgenoot van ons aan te sluiten?' De groep explodeert met gejuich terwijl ze rennen om zich bij je gelederen te voegen.

source: The dwarves hail you, "Any friend of Roland is a friend of ours. You may pass."
nl: De dwergen begroeten je, "Elke vriend van Roland is een vriend van ons. Je mag passeren."

source: The ogres give you a grunt of recognition, "Archibald's allies may pass."
nl: De ogres geven je een grom van herkenning, "Archibald's bondgenoten kunnen passeren."

source: The dragons see you and call out. "Our alliance with Archibald compels us to join you. Unfortunately you have no room. A pity!" They quickly scatter.
nl: De draken zien je en roepen. "Onze alliantie met Archibald dwingt ons om met je mee te doen. Helaas heb je geen ruimte. Jammer!" Ze verspreiden zich snel.

source: The elves stand at attention as you approach. Their leader calls to you and says, "Let us not impede your progress, ally! Move on, and may victory be yours."
nl: De elfen staan in de houding als je dichterbij komt. Hun leider roept je en zegt: "Laten we je voortgang niet belemmeren, bondgenoot! Ga verder, en moge de overwinning van jou zijn."

source: "The Dwarfbane!!!!, run for your lives."
nl: "The Dwarfbane!!!!, ren voor je leven."

source: campaignBonus|Ballista
nl: Ballista

source: campaignBonus|Black Pearl
nl: Zwarte Parel

source: campaignBonus|Caster's Bracelet
nl: Caster's Armband

source: campaignBonus|Defender Helm
nl: Verdediger Helm

source: campaignBonus|Breastplate
nl: Borstplaat

source: campaignBonus|Dragon Sword
nl: Draken Zwaard

source: campaignBonus|Fizbin Medal
nl: Fizbin Medaille

source: campaignBonus|Foremost Scroll
nl: Voorste Scroll

source: campaignBonus|Hideous Mask
nl: Afschuwelijk Masker

source: campaignBonus|Mage's Ring
nl: Magiër's Ring

source: campaignBonus|Major Scroll
nl: Grote Rol

source: campaignBonus|Medal of Honor
nl: Medaille van Eer

source: campaignBonus|Medal of Valor
nl: Medaille van Moed

source: campaignBonus|Minor Scroll
nl: Kleine Rol

source: campaignBonus|Nomad Boots
nl: Nomadenlaarzen

source: campaignBonus|Power Axe
nl: Macht bijl

source: campaignBonus|Spiked Shield
nl: Puntig Schild

source: campaignBonus|Stealth Shield
nl: Stealth-schild

source: campaignBonus|Tax Lien
nl: Belastingrecht

source: campaignBonus|Thunder Mace
nl: Donder Mace

source: campaignBonus|Traveler's Boots
nl: Reizigerslaarzen

source: campaignBonus|White Pearl
nl: Witte Parel

source: campaignBonus|Basic Archery
nl: Basis Boogschieten

source: campaignBonus|Advanced Archery
nl: Geavanceerd Boogschieten

source: campaignBonus|Expert Archery
nl: Expert Boogschieten

source: campaignBonus|Basic Ballistics
nl: Basis Ballistiek

source: campaignBonus|Advanced Ballistics
nl: Geavanceerd Ballistiek

source: campaignBonus|Expert Ballistics
nl: Expert Ballistiek

source: campaignBonus|Basic Diplomacy
nl: Basis Diplomatie

source: campaignBonus|Advanced Diplomacy
nl: Geavanceerd Diplomatie

source: campaignBonus|Expert Diplomacy
nl: Expert Diplomatie

source: campaignBonus|Basic Eagle Eye
nl: Basis Adelaarsoog

source: campaignBonus|Advanced Eagle Eye
nl: Geavanceerd Adelaarsoog

source: campaignBonus|Expert Eagle Eye
nl: Expert Adelaarsoog

source: campaignBonus|Basic Estates
nl: Basis Landgoederen

source: campaignBonus|Advanced Estates
nl: Geavanceerd Landgoederen

source: campaignBonus|Expert Estates
nl: Expert Landgoederen

source: campaignBonus|Basic Leadership
nl: Basis Leiderschap

source: campaignBonus|Advanced Leadership
nl: Geavanceerd Leiderschap

source: campaignBonus|Expert Leadership
nl: Expert Leiderschap

source: campaignBonus|Basic Logistics
nl: Basis Logistiek

source: campaignBonus|Advanced Logistics
nl: Geavanceerd Logistiek

source: campaignBonus|Expert Logistics
nl: Expert Logistiek

source: campaignBonus|Basic Luck
nl: Basis Geluk

source: campaignBonus|Advanced Luck
nl: Geavanceerd Geluk

source: campaignBonus|Expert Luck
nl: Expert Geluk

source: campaignBonus|Basic Mysticism
nl: Basis Mystiek

source: campaignBonus|Advanced Mysticism
nl: Geavanceerd Mystiek

source: campaignBonus|Expert Mysticism
nl: Expert Mystiek

source: campaignBonus|Basic Navigation
nl: Basis Navigatie

source: campaignBonus|Advanced Navigation
nl: Geavanceerd Navigatie

source: campaignBonus|Expert Navigation
nl: Expert Navigatie

source: campaignBonus|Basic Necromancy
nl: Basis Necromantie

source: campaignBonus|Advanced Necromancy
nl: Geavanceerd Necromantie

source: campaignBonus|Expert Necromancy
nl: Expert Necromantie

source: campaignBonus|Basic Pathfinding
nl: Basis Padvinden

source: campaignBonus|Advanced Pathfinding
nl: Geavanceerd Padvinden

source: campaignBonus|Expert Pathfinding
nl: Expert Padvinden

source: campaignBonus|Basic Scouting
nl: Basis Scouting

source: campaignBonus|Advanced Scouting
nl: Geavanceerd Scouting

source: campaignBonus|Expert Scouting
nl: Expert Scouting

source: campaignBonus|Basic Wisdom
nl: Basis Wijsdom

source: campaignBonus|Advanced Wisdom
nl: Geavanceerd Wijsdom

source: campaignBonus|Expert Wisdom
nl: Expert Wijsdom

source: campaignBonus|Animate Dead
nl: Dood Animeren

source: campaignBonus|Chain Lightning
nl: Ketting Bliksem

source: campaignBonus|Fireblast
nl: Vuurstraal

source: campaignBonus|Mass Curse
nl: Massa Vloek

source: campaignBonus|Mass Haste
nl: Massale Haast

source: campaignBonus|Mirror Image
nl: Spiegelbeeld

source: campaignBonus|Resurrect
nl: Herrijzen

source: campaignBonus|Steelskin
nl: Staalhuid

source: campaignBonus|Summon Earth
nl: Aarde Oproepen

source: campaignBonus|View Heroes
nl: Bekijk Helden

source: The main hero will have "%{artifact}" artifact at the start of the scenario.
nl: De hoofdheld zal het "%{artifact}" artefact hebben aan het begin van het scenario.

source: The kingdom will receive %{amount} additional %{resource} at the start of the scenario.
nl: Het koninkrijk zal aan het begin van het scenario %{amount} extra %{resource} ontvangen.

source: The kingdom will have %{amount} less %{resource} at the start of the scenario.
nl: Het koninkrijk zal %{amount} minder %{resource} hebben aan het begin van het scenario.

source: The main hero will have %{count} %{monster} at the start of the scenario.
nl: De hoofdheld heeft %{count} %{monster} aan het begin van het scenario.

source: The main hero will have "%{spell}" spell at the start of the scenario.
nl: De hoofdheld heeft de spreuk "%{spell}" aan het begin van het scenario.

source: The starting race of the scenario will be %{race}.
nl: De startrace van het scenario is %{race}.

source: The main hero will have additional %{count} %{skill} at the start of the scenario.
nl: De hoofdheld heeft extra %{count} %{skill} aan het begin van het scenario.

source: The main hero will have %{skill} at the start of the scenario.
nl: De hoofdheld heeft %{skill} aan het begin van het scenario.

source: The Price of Loyalty
nl: De Prijs van Loyaliteit

source: Voyage Home
nl: Rijs Naar Huis

source: Wizard's Isle
nl: Tovenaarseiland

source: Descendants
nl: Afstammelingen

source: The %{building} produces %{monster}.
nl: Het %{gebouw} produceert %{monster}.

source: Requires:
nl: Vereist:

source: Cannot build. You have already built here today.
nl: Kan niet bouwen. Je hebt hier vandaag al gebouwd.

source: For this action it is necessary to build a castle first.
nl: Voor deze actie moet je eerst een kasteel bouwen.

source: Cannot build %{name} because castle is too far from water.
nl: Kan %{name} niet bouwen omdat het kasteel te ver van water is.

source: disable build.
nl: bouwen uitschakelen.

source: Cannot afford %{name}.
nl: Kan %{name} niet betalen.

source: %{name} is already built.
nl: %{name} is al gebouwd.

source: Cannot build %{name}.
nl: Kan %{name} niet bouwen.

source: Build %{name}.
nl: Bouw %{name}.

source: Dragontooth
nl: Drakentand

source: Cannot recruit - guest to guard automove error.
nl: Kan niet rekruteren - gast om automove-fout te bewaken.

source: Cannot recruit - you already have a Hero in this town.
nl: Kan niet rekruteren - je hebt al een held in dit dorp.

source: Cannot recruit - you have too many Heroes.
nl: Kan niet rekruteren - je hebt te veel helden.

source: Cannot afford a Hero
nl: Kan een held niet betalen

source: There is no room in the garrison for this army.
nl: Er is geen plaats in het garnizoen voor dit leger

source: Fortifications
nl: Vestingwerken

source: Farm
nl: Boerderij

source: Thatched Hut
nl: Strohut

source: Archery Range
nl: Boogschietbaan

source: Upg. Archery Range
nl: Upg. Boogschietbaan

source: Blacksmith
nl: Smid

source: Upg. Blacksmith
nl: Upg. Smid

source: Armory
nl: Wapenkamer

source: Upg. Armory
nl: Upg. Wapenkamer

source: Jousting Arena
nl: Steekspelarena

source: Upg. Jousting Arena
nl: Upg. Steekspelarena

source: Cathedral
nl: Kathedraal

source: Upg. Cathedral
nl: Upg. Kathedraal

source: Coliseum
nl: Colleseum

source: Garbage Heap
nl: Vuilnishoop

source: Stick Hut
nl: Stokken Hut

source: Upg. Stick Hut
nl: Upg. Stokken Hut

source: Bridge
nl: Brug

source: Upg. Bridge
nl: Upg. Brug

source: Pyramid
nl: Piramide

source: Rainbow
nl: Regenboog

source: Crystal Garden
nl: Kristal Tuin

source: Treehouse
nl: Boomhut

source: Cottage
nl: Huisje

source: Upg. Cottage
nl: Upg. Huisje

source: Fenced Meadow
nl: Omheinde weide

source: sorceress|Red Tower
nl: Rode Toren

source: Dungeon
nl: Kerker

source: Waterfall
nl: Waterval

source: Cave
nl: Gro

source: Maze
nl: Doolhof

source: Upg. Maze
nl: Upg. Doolhof

source: Swamp
nl: Moeras

source: Green Tower
nl: Groene Toren

source: warlock|Red Tower
nl: Rode Toren

source: Black Tower
nl: Zwarde Toren

source: Library
nl: Bibliotheek

source: Orchard
nl: Boomgaard

source: Foundry
nl: Gieterij

source: Upg. Foundry
nl: Upg. Gieterij

source: Cliff Nest
nl: Klif Nest

source: Ivory Tower
nl: Ivoren Toren

source: Upg. Ivory Tower
nl: Upg. Ivoren toren

source: Cloud Castle
nl: Wolk Kasteel

source: Upg. Cloud Castle
nl: Upg. Wolk Kasteel

source: Skull Pile
nl: Schedel stapel

source: Excavation
nl: Uitgraving

source: Graveyard
nl: Begraafplaats

source: Upg. Graveyard
nl: Upg. Begraafplaats

source: Upg. Pyramid
nl: Upg. Piramide

source: Mansion
nl: Herenhuis

source: Upg. Mansion
nl: Upg. Herenhuis

source: Laboratory
nl: Laboratorium

source: Shrine
nl: Altaar

source: The Fortifications increase the toughness of the walls, increasing the number of turns it takes to knock them down.
nl: De versterkingen verhogen de taaiheid van de muren, waardoor het aantal beurten dat nodig is om ze omver te werpen toeneemt.

source: The Farm increases production of Peasants by %{count} per week.
nl: De boerderij verhoogt de productie van boeren met %{count} per week.

source: The Coliseum provides inspiring spectacles to defending troops, raising their morale by two during combat.
nl: Het Colosseum biedt een inspirerend schouwspel voor verdedigende troepen en verhoogt hun moreel met twee tijdens gevechten.

source: The Garbage Heap increases production of Goblins by %{count} per week.
nl: De Garbage Heap verhoogt de productie van Goblins met %{count} per week.

source: The Rainbow increases the luck of the defending units by two.
nl: De regenboog verhoogt het geluk van de verdedigende eenheden met twee.

source: The Crystal Garden increases production of Sprites by %{count} per week.
nl: De Crystal Garden verhoogt de productie van Sprites met %{count} per week.

source: The Dungeon increases the income of the town by %{count} / day.
nl: De kerker verhoogt het inkomen van de stad met %{count} / dag.
