Repository: ihhub/fheroes2
Catalog: files/lang/*.po
Languages: nl

source: Ogre Lords
nl: Ogre Lijders

source: Troll
nl: Trol

source: Trolls
nl: Trollen

source: War Troll
nl: Oorlogs Trol

source: War Trolls
nl: Oorlogs Trollen

source: Cyclopes
nl: Cyclopen

source: Cyclops
nl: Cycloop

source: Sprites
nl: Spriten

source: Dwarf
nl: Dwerg

source: Dwarves
nl: Dwergen

source: Battle Dwarf
nl: Gevechts Dwerg

source: Battle Dwarves
nl: Gevechts Dwergen

source: Elves
nl: Elven

source: Grand Elf
nl: Grote Elf

source: Grand Elves
nl: Grote Elven

source: Druid
nl: Druïde

source: Druids
nl: Druïden

source: Greater Druid
nl: Grotere Druïde

source: Greater Druids
nl: Grotere Druïdes

source: Unicorn
nl: Eenhorn

source: Unicorns
nl: Eenhorns

source: Phoenix
nl: Feniks

source: Phoenixes
nl: Feniksen

source: Gargoyle
nl: Waterspuwer

source: Gargoyles
nl: Waterspuwers

source: Griffin
nl: Griffioen

source: Griffins
nl: Griffioenen

source: Minotaur
nl: Minotaurus

source: Minotaurs
nl: Minotaurussen

source: Minotaur King
nl: Minotaurus Koning

source: Minotaur Kings
nl: Minotaurussen Koningen

source: Green Dragon
nl: Groene Draak

source: Green Dragons
nl: Groene Draaken

source: Red Dragon
nl: Roode Draak

source: Red Dragons
nl: Roode Draaken

source: Black Dragon
nl: Zwarte Draak

source: Black Dragons
nl: Zwarte Draaken

source: Halflings
nl: Halflingen

source: Boar
nl: Zwijn

source: Boars
nl: Zwijnen

source: Iron Golem
nl: Ijzeren Golem

source: Iron Golems
nl: Ijzeren Golems

source: Steel Golem
nl: Stalen Golem

source: Steel Golems
nl: Stalen Golems

source: Rocs
nl: Rocken

source: Mage
nl: Magiër

source: Archmage
nl: Aartsmagiër

source: Archmagi
nl: Aartsmagi

source: Giant
nl: Gigant

source: Giants
nl: Giganten

source: Titan
nl: Titaan

source: Titans
nl: Titanen

source: Skeletons
nl: Skeleten

source: Mutant Zombie
nl: Gemuteerde Zombie

source: Mutant Zombies
nl: Gemuteerde Zombies

source: Royal Mummies
nl: Royaale Mummies

source: Royal Mummy
nl: Royaale Mummy

source: Vampire
nl: Vampier

source: Vampires
nl: Vampieren

source: Vampire Lord
nl: Vampiere Heer

source: Vampire Lords
nl: Vampieren Heren

source: Lich
nl: Lichu

source: Liches
nl: Lichus

source: Power Lich
nl: Kracht Lichu

source: Power Liches
nl: Krachten Lichus

source: Bone Dragon
nl: Botte Draak

source: Bone Dragons
nl: Botte Draaken

source: Rogue
nl: Schurk

source: Rogues
nl: Schurken

source: Nomad
nl: Nomade

source: Nomads
nl: Nomaden

source: Ghost
nl: Geest

source: Ghosts
nl: Geesten

source: Earth Elemental
nl: Aarde Elementair

source: Earth Elementals
nl: Aarde Elementairs

source: Air Elemental
nl: Lucht Elementair

source: Air Elementals
nl: Lucht Elementairs

source: Fire Elemental
nl: Vuur Elementair

source: Fire Elementals
nl: Vuur Elementairs

source: Water Elemental
nl: Water Elementair

source: Water Elementals
nl: Water Elementairs

source: Random Monsters
nl: Willekurige Monsters

source: Random Monster 1
nl: Willekurig Monster 1

source: Random Monsters 1
nl: Willekurige Monsters 1

source: Random Monster 2
nl: Willekurig Monster 2

source: Random Monsters 2
nl: Willekurige Monsters 2

source: Random Monster 3
nl: Willekurig Monster 3

source: Random Monsters 3
nl: Willekurige Monsters 3

source: Random Monster 4
nl: Willekurig Monster 4

source: Random Monsters 4
nl: Willekurige Monsters 4

source: Double shot
nl: Dubbel schot

source: Double strike
nl: Dubbele slag

source: Double damage to Undead
nl: Dubbele schade aan undood

source: % magic resistance
nl: % weerstand tot magie

source: Immune to Mind spells
nl: Immuun tot Verstand spreuken

source: Immune to Elemental spells
nl: Immuun tot Elementaire spreuken

source: Immune to Fire spells
nl: Immuun tot Vuur spreuken

source: Immune to Cold spells
nl: Immuun tot Koud spreuken

source: Immune to
nl: Immuun tot

source: % immunity to %{spell} spell
nl: % immuniteit voor de %{spell} spreuk

source: % damage from Elemental spells
nl: % schade van Elementaire spreuken

source: % chance to Dispel beneficial spells
nl: % kans om gunstige spreuken af te wijzen

source: % chance to Paralyze
nl: % kans om te Paralyzeren

source: % chance to Petrify
nl: % kans om te Verstenen

source: % chance to Blind
nl: % kans om te Verblinden

source: % chance to Curse
nl: % kans om te Vervloeken

source: % chance to cast %{spell} spell
nl: % kans om de spreuk %{spell} uit te spreken

source: HP regeneration
nl: HP regeneratie

source: Two hexes attack
nl: Twee hexadecimale aanvallen

source: Flyer
nl: Vlieger

source: Always retaliates
nl: Neemt altijd wraak

source: Attacks all adjacent enemies
nl: Valt alle aangrenzende vijanden aan

source: No melee penalty
nl: Geen melee-penalty

source: Dragon
nl: Draak

source: Undead
nl: Ondood

source: No enemy retaliation
nl: Geen vijhand wraak

source: HP drain
nl: HP-afvoer

source: Cloud attack
nl: Lucht aanval

source: Decreases enemy's morale by
nl: Vermindert veihandelijk moreel met

source: % chance to halve enemy
nl: % kans om veihand te halveren

source: Soul Eater
nl: Ziel Eter

source: Elemental
nl: Elementair

source: No Morale
nl: Geen Moreel

source: 200% damage from Fire spells
nl: 200% schade van Vuur Spreuken

source: 200% damage from Cold spells
nl: 200% schade van Koud Spreuken

source: % damage from %{spell} spell
nl: % schade van de spreuk %{spell}

source: % immunity to
nl: % immuniteit voor

source: Lightning
nl: Bliksem

source: % damage from
nl: % schade van

source: The three Anduran artifacts magically combine into one.
nl: De drie Andurese artefacten combineren op magische wijze tot één.

source: View Spells
nl: Bekijk Spreuken

source: View %{name} Info
nl: Bekijk info van %{name}

source: Move %{name}
nl: Verplaats %{name}

source: Cannot move the Spellbook
nl: Kan het spreukenboek niet verplaatsen

source: This item can't be traded.
nl: Dit voorwerp kan niet worden geruild.

source: The %{name} increases your knowledge by %{count}.
nl: De %{name} vergroot je kennis met %{count}.

source: Ultimate Book of Knowledge
nl: Ultiem Boek van Kennis

source: The %{name} increases your attack skill by %{count}.
nl: De %{name} verhoogt je aanvalsvaardigheid met %{count}.

source: Ultimate Sword of Dominion
nl: Ultiem Zwaard van Heerschappij

source: The %{name} increases your defense skill by %{count}.
nl: De %{name} verhoogt je verdedigingsvaardigheid met %{count}.

source: Ultimate Cloak of Protection
nl: Ultieme beschermingsmantel

source: The %{name} increases your spell power by %{count}.
nl: De %{name} verhoogt je spreukkracht met %{count}.

source: Ultimate Wand of Magic
nl: Ultieme toverstaf

source: The %{name} increases your attack and defense skills by %{count} each.
nl: De %{name} verhoogt je aanvals- en verdedigingsvaardigheden met elk %{count}.

source: Ultimate Shield
nl: Ultiem schild

source: The %{name} increases your spell power and knowledge by %{count} each.
nl: Ultieme staf

source: The %{name} increases each of your basic skills by %{count} points.
nl: De %{name} verhoogt elk van je basisvaardigheden met %{count} punten.

source: Ultimate Crown
nl: Ultieme Kroon

source: Golden Goose
nl: Gouden Eend

source: The %{name} brings in an income of %{count} gold per day.
nl: De %{name} levert een inkomen op van %{count} goud per dag.

source: Arcane Necklace of Magic
nl: Arcane Ketting van Magie

source: After rescuing a Sorceress from a cursed tomb, she rewards your heroism with an exquisite jeweled necklace.
nl: Nadat ze een tovenares uit een vervloekt graf heeft gered, beloont ze je heldhaftigheid met een prachtige halsketting met juwelen.

source: Caster's Bracelet of Magic
nl: Caster's armband van magie

source: While searching through the rubble of a caved-in mine, you free a group of trapped Dwarves. Grateful, the leader gives you a golden bracelet.
nl: Terwijl je door het puin van een ingestorte mijn zoekt, bevrijd je een groep gevangen Dwergen. Dankbaar geeft de leider je een gouden armband.

source: Mage's Ring of Power
nl: Magier's Ring van Kracht

source: A cry of pain leads you to a Centaur, caught in a trap. Upon setting the creature free, he hands you a small pouch. Emptying the contents, you find a dazzling jeweled ring.
nl: Een kreet van pijn leidt je naar een Centaur, gevangen in een val. Nadat hij het wezen heeft bevrijd, geeft hij je een klein zakje. Als je de inhoud leegmaakt, vind je een oogverblindende ring met juwelen.
