Repository: ihhub/fheroes2
Catalog: files/lang/*.po
Languages: nl

source: The Waterfall increases production of Centaurs by %{count} per week.
nl: De waterval verhoogt de productie van Centauren met %{count} per week.

source: The Library increases the number of spells in the Guild by one for each level of the guild.
nl: De bibliotheek verhoogt het aantal spreuken in de gilde met één voor elk niveau van de gilde.

source: The Orchard increases production of Halflings by %{count} per week.
nl: The Orchard verhoogt de productie van Halflings met %{count} per week.

source: The Storm adds +2 to the power of spells of a defending spell caster.
nl: De storm voegt +2 toe aan de kracht van spreuken van een verdedigende spreukgebruiker.

source: The Skull Pile increases production of Skeletons by %{count} per week.
nl: De Skull Pile verhoogt de productie van Skeletten met %{count} per week.

source: Thieves' Guild
nl: Dievengilde

source: Tavern
nl: Taverne

source: Shipyard
nl: Scheepswerf

source: Well
nl: Put

source: Statue
nl: Standbeeld

source: Marketplace
nl: Marktplaats

source: Moat
nl: Gracht

source: Castle
nl: Kasteel

source: Captain's Quarters
nl: Kapiteinsverblijf

source: Mage Guild, Level 1
nl: Mage Gilde, Level 1

source: Mage Guild, Level 2
nl: Mage Gilde, Level 2

source: Mage Guild, Level 3
nl: Mage Gilde, Level 3

source: Mage Guild, Level 4
nl: Mage Gilde, Level 4

source: Mage Guild, Level 5
nl: Mage Gilde, Level 5

source: The Shrine increases the necromancy skill of all your necromancers by 10 percent.
nl: De Shrine verhoogt de necromantievaardigheid van al je necromancers met 10 procent.

source: The Thieves' Guild provides information on enemy players. Thieves' Guilds can also provide scouting information on enemy towns. Additional Guilds provide more information.
nl: The Thieves' Guild geeft informatie over vijandelijke spelers. Dievengilden kunnen ook verkenningsinformatie geven over vijandelijke steden. Aanvullende gilden geven meer informatie.

source: The Tavern increases morale for troops defending the castle.
nl: De Tavern verhoogt het moreel voor troepen die het kasteel verdedigen.

source: The Shipyard allows ships to be built.
nl: Op de Scheepswerf kunnen schepen worden gebouwd.

source: The Well increases the growth rate of all dwellings by %{count} creatures per week.
nl: The Well verhoogt de groeisnelheid van alle woningen met %{count} schepsels

source: The Statue increases your town's income by %{count} per day.
nl: Het standbeeld verhoogt het inkomen van je stad met %{count} per dag.

source: The Left Turret provides extra firepower during castle combat.
nl: De Linker Turret zorgt voor extra vuurkracht tijdens kasteelgevechten.

source: The Right Turret provides extra firepower during castle combat.
nl: De Rechter Turret zorgt voor extra vuurkracht tijdens kasteelgevechten.

source: The Marketplace can be used to convert one type of resource into another. The more marketplaces you control, the better the exchange rate.
nl: De Marketplace kan worden gebruikt om het ene type resource om te zetten in een ander. Hoe meer marktplaatsen u beheert, hoe beter de wisselkoers.

source: The Moat slows attacking units. Any unit entering the moat must end its turn there and becomes more vulnerable to attack.
nl: De gracht vertraagt aanvallende eenheden. Elke eenheid die de gracht binnengaat, moet zijn beurt daar beëindigen en wordt kwetsbaarder voor aanvallen.

source: The Castle improves town defense and increases income to %{count} gold per day.
nl: Het kasteel verbetert de stadsverdediging en verhoogt het inkomen tot %{count} goud per dag.

source: The Tent provides workers to build a castle, provided the materials and the gold are available.
nl: De Tent levert arbeiders om een kasteel te bouwen, mits de materialen en het goud beschikbaar zijn.

source: The Captain's Quarters provides a captain to assist in the castle's defense when no hero is present.
nl: De Captain's Quarters biedt een kapitein om te helpen bij de verdediging van het kasteel als er geen held aanwezig is.

source: The Mage Guild allows heroes to learn spells and replenish their spell points.
nl: Met de Mage Guild kunnen helden spreuken leren en hun spreukpunten aanvullen.

source: Recruit %{name}
nl: Rekruteer %{name}

source: Month: %{month}, Week: %{week}, Day: %{day}
nl: Maand: %{month}, Week: %{week}, Dag: %{day}

source: You must purchase a spell book to use the mage guild, but you currently have no room for a spell book. Try giving one of your artifacts to another hero.
nl: Je moet een spreukenboek kopen om de tovenaarsgilde te gebruiken, maar je hebt momenteel geen ruimte voor een spreukenboek. Probeer een van je artefacten aan een andere held te geven.

source: Exit
nl: Afsluiten

source: Exit this menu.
nl: Dit menu verlaten

source: Click to show next town.
nl: Klik om de volgende stad weer te geven.

source: Show next town
nl: Bekijk volgende stad

source: Click to show previous town.
nl: Klik om vorige stad weer te geven.

source: Show previous town
nl: Bekijk vorige stad

source: Army joining
nl: Leger toetreden

source: Unable to merge two armies together. Rearrange monsters manually before moving the hero to the garrison.
nl: Kan twee legers niet samenvoegen. Herschik monsters handmatig voordat je de held naar het garnizoen verplaatst.

source: This town may not be upgraded to a castle.
nl: Deze stad mag niet worden opgewaardeerd tot een kasteel.

source: Town
nl: Dorp

source: Exit Castle
nl: Kasteel Verlaten

source: Exit Town
nl: Dorp Verlaten

source: Show Income
nl: Inkomen Weergeven

source: Swap Heroes
nl: Ruil Helden

source: Meeting Heroes
nl: Helden Ontmoeten

source: View Hero
nl: Held bekijken

source: The above spells are available here.
nl: De bovenstaande spreuken zijn hier beschikbaar.

source: The above spells have been added to your book.
nl: De bovenstaande spreuken zijn toegevoegd aan je boek.

source: A generous tip for the barkeep yields the following rumor:
nl: Een royale fooi voor de barkeeper levert het volgende gerucht op:

source: Recruit Hero
nl: Held Rekruteren

source: %{name} is a level %{value} %{race}
nl: %{name} is een level %{value} %{race}

source: with %{count} artifacts.
nl: met %{count} artefacten.

source: with 1 artifact.
nl: met 1 artefact.

source: without artifacts.
nl: zonder artefacten.

source: 'Spread' combat formation spreads your armies from the top to the bottom of the battlefield, with at least one empty space between each army.
nl: 'Spread'-gevechtsformatie verspreidt je legers van boven naar beneden op het slagveld, met ten minste één lege ruimte tussen elk leger.

source: 'Grouped' combat formation bunches your army toget her in the center of your side of the battlefield.
nl: 'Gegroepeerde' gevechtsformatie bundelt je leger om haar in het midden van jouw kant van het slagveld te krijgen.

source: Spread Formation
nl: Verspreidings Formatie

source: Grouped Formation
nl: Groupeerde Formatie

source: Recruit %{name} the %{race}
nl: Rekruteer %{name} de %{race}

source: Set garrison combat formation to 'Spread'
nl: Stel garnizoensgevechtsformatie in op 'Spread'

source: Set garrison combat formation to 'Grouped'
nl: Stel garnizoensgevechtsformatie in op 'Grouped'

source: Exit Castle Options
nl: Kasteelopties Verlaten

source: Castle Options
nl: Kasteelopties

source: Not enough resources to recruit creatures.
nl: Niet genoeg middelen om schepsels te rekruteren.

source: You are unable to recruit at this time, your ranks are full.
nl: U kunt op dit moment niet rekruteren, uw gelederen zijn vol.

source: No creatures available for purchase.
nl: Geen schepsels beschikbaar voor aankoop.

source: Recruit Creatures
nl: Rekruteer Schepsels

source: Hire all creatures in the town.
nl: Rekruteer alle schepsels in het dorp.

source: Town Population Information and Statistics
nl: Stad Bevolkingsinformatie en Statistieken

source: Damg
nl: Schade

source: Growth
nl: Groei

source: Available
nl: Beschikbare

source: View World
nl: Bekijk Wereld

source: View the entire world.
nl: Bekijk de gehele wereld.

source: Puzzle
nl: Puzzel

source: View the obelisk puzzle.
nl: Bekijk de obelisk puzzel.

source: Scenario Information
nl: Scenario Informatie

source: View information on the scenario you are currently playing.
nl: Bekijk informatie over het scenario dat je momenteel speelt.

source: Dig for the Ultimate Artifact.
nl: Graaf naar het ultieme artefact.

source: Digging
nl: Graven

source: Exit this menu without doing anything.
nl: Verlaat dit menu zonder iets te doen.

source: You enter the arena and face a pack of vicious lions. You handily defeat them, to the wild cheers of the crowd. Impressed by your skill, the aged trainer of gladiators agrees to train you in a skill of your choice.
nl: Je betreedt de arena en staat tegenover een roedel gemene leeuwen. Je verslaat ze handig, onder het wilde gejuich van de menigte. Onder de indruk van je vaardigheden, stemt de bejaarde gladiatorentrainer ermee in je te trainen in een vaardigheid naar keuze.

source: You can't afford to upgrade your troops!
nl: Je kunt het je niet betalen om je troepen te upgraden!

source: Your troops can be upgraded, but it will cost you dearly. Do you wish to upgrade them?
nl: Je troepen kunnen worden opgewaardeerd, maar het zal je duur komen te staan. Wil je ze upgraden?

source: Are you sure you want to dismiss this army?
nl: Weet je zeker dat je dit leger wilt ontslaan?

source: Attack Skill
nl: Aanvalsvaardigheid

source: Defense Skill
nl: Verdedigingsvaardigheid

source: Shots
nl: Schoten

source: Shots Left
nl: Schoten over

source: Damage
nl: Schade

source: Hit Points
nl: Hitpunten

source: Hit Points Left
nl: Hitpunten Over

source: Followers
nl: Volgers

source: A group of %{monster} with a desire for greater glory wish to join you. Do you accept?
nl: Accepteer je?

source: The %{monster} is swayed by your diplomatic tongue, and offers to join your army for the sum of %{gold} gold. Do you accept?
nl: Het %{monster} wordt beïnvloed door uw diplomatieke taal en biedt aan om zich bij uw leger aan te sluiten voor de som van %{gold} goud. Accepteer je?

source: The creatures are swayed by your diplomatic tongue, and make you an offer:
nl: De schepsels worden beïnvloed door je diplomatieke tong, en doen je een aanbod:

source: %{offer} of the %{total} %{monster} will join your army, and the rest will leave you alone, for the sum of %{gold} gold. Do you accept?
nl: %{offer} van de %{total} %{monster} zal zich bij je leger voegen, en de rest zal je met rust laten, voor de som van %{goud} goud. Accepteer je?

source: All %{offer} of the %{monster} will join your army for the sum of %{gold} gold. Do you accept?
nl: Alle %{offer} van het %{monster} zullen zich bij je leger voegen voor de som van %{gold} goud. Accepteer je?

source: (Rate: %{percent})
nl: (Percentage: %{percent})

source: off
nl: uit

source: Music
nl: Muziek

source: Effects
nl: Effecten

source: MIDI Expansion
nl: MIDI Uitbreiding

source: External
nl: Extern

source: Music Type
nl: Muziek Type

source: Toggle ambient music level.
nl: Wisselen van omgevingsmuziekniveau.

source: Toggle foreground sounds level.
nl: Wisselen van voorgrondsmuziekniveau.

source: Change the type of music.
nl: Verander het type van muziek.

source: Toggle 3D effects of foreground sounds.
nl: Schakel 3D-effecten van voorgrondgeluiden in.

source: Okay
nl: Oké

source: Build a new ship:
nl: Bouw een nieuw schip:

source: Resource cost:
nl: Bronkosten:

source: Total:
nl: Totaal:

source: Need:
nl: Behoefte:

source: Load Game
nl: Laad Spel

source: No save files to load.
nl: Geen bestanden om te laden.

source: New Game
nl: Nieuw Spel

source: Start a single or multi-player game.
nl: Start een single of multi-player spel.

source: Load a previously saved game.
nl: Laad een vorig opgeslagen spel.

source: Save Game
nl: Spel opslaan.

source: Save the current game.
nl: Sla het huidige spel op.

source: Quit
nl: Aflsuiten

source: Quit out of Heroes of Might and Magic II.
nl: Aflsuiten uit Heroes of Might and Magic II.

source: Language
nl: Taal

source: Resolution
nl: Resolutie

source: Experimental
nl: Experimentaal

source: Settings
nl: Instellingen

source: Configure
nl: Configureren

source: Hot Keys
nl: Sneltoetsen

source: Black & White
nl: Zwart & Wit

source: Mouse Cursor
nl: Cursor

source: Color
nl: Kleur

source: Text Support
nl: Tekst Ondersteuning

source: Evil
nl: Kwaad

source: Good
nl: Goed

source: Auto Resolve
nl: Automatisch Oplossen

source: Auto, No Spells
nl: Automatisch, Geen Spreuken

source: Manual
nl: Handmatig

source: Battles
nl: Gevechten

source: Select Game Language
nl: Selecteer Spel Taal

source: Change the language of the game.
nl: Verander de taal van het spel.

source: Select Game Resolution
nl: Selecteer Spel Resolutie

source: Change the resolution of the game.
nl: Verander de resolutie van het spel.

source: Change the audio settings of the game.
nl: Vander de audio instellingen van het spel.

source: Experimental game settings.
nl: Experimenteele spel instellingen.

source: Toggle instant battle mode.
nl: Schakel directe gevechtsmodus

source: Check and configure all the hot keys present in the game.
nl: Controleer en configureer alle sneltoetsen die in het spel aanwezig zijn.

source: Toggle the type of interface you want to use.
nl: Schakel het type interface dat u wilt gebruiken.

source: Toggle colored cursor on or off. This is only an esthetic choice.
nl: Zet gekleurde cursor aan of uit. Dit is slechts een esthetische keuze.

source: Toggle text support mode to output extra information about windows and events in the game.
nl: Schakel de tekstondersteuningsmodus in om extra informatie over vensters en gebeurtenissen in het spel weer te geven.

source: Attention
nl: Belangrijk

source: Your version of Heroes of Might and Magic II does not support any other languages than English.
nl: Jouw versie van Heroes of Might and Magic II ondersteund geen andere talen dan Engels.

source: Map Difficulty
nl: Kaart Moeilijkeid

source: Game Difficulty
nl: Spel Moeilijkeid

source: Rating
nl: Beoordeling

source: Map Size
nl: Kaart Grote

source: Opponents
nl: Tegenstanders

source: Class
nl: Klasse

source: Victory Conditions
nl: Overwinning Condities

source: Loss Conditions
nl: Verlies Condities

source: First select recipients!
nl: Selecteer eerst ontvangers!

source: You cannot select %{resource}!
nl: Je kan %{resource} niet selecteren!

source: Select count %{resource}:
nl: Selecteer tel %{resource}:

source: Select Recipients
nl: Selecteer Ontvangers

source: Your Funds
nl: Je Fondsen

source: Planned Gift
nl: Gepland Cadeau

source: Gift from %{name}
nl: Cadeau van %{name}

source: Set Guardian
nl: Bewaker Instellen

source: Your army too big!
nl: Je leger te groot!

source: Hot Keys:
nl: Sneltoetsen:

source: Select Game Language:
nl: Selecteer Spel Taal:

source: %{name} has gained a level.
nl: %{name} heeft een niveau bereikt.

source: You have learned %{skill}.
nl: Je hebt %{skill} geleerd.

source: You may learn either:
nl: You kunt leren:

source: or
nl: of

source: Please inspect our fine wares. If you feel like offering a trade, click on the items you wish to trade with and for.
nl: Gelieve te inspecteren onze fijne waren. Als u een ruil wilt aanbieden, klikt u op de items waarmee en waarvoor u wilt ruilen.

source: You have received quite a bargain. I expect to make no profit on the deal. Can I interest you in any of my other wares?
nl: Je hebt een aardig koopje gekregen. Ik verwacht geen winst te maken op de deal. Kan ik u interesseren voor een van mijn andere waren?

source: I can offer you %{count} for 1 unit of %{resfrom}.
nl: Ik kan je %{count} aanbieden voor 1 eenheid van %{resfrom}.

source: I can offer you 1 unit of %{resto} for %{count} units of %{resfrom}.
nl: Ik kan je 1 eenheid van %{resto} aanbieden voor %{count} eenheden van %{resfrom}.

source: Qty to trade
nl: Te ruilen aantal

source: Trading Post
nl: Handelspost

source: Your Resources
nl: Je Bronnen

source: Available Trades
nl: Beschrikbare Handelaars

source: n/a
nl: nvt

source: guarded by
nl: beschermt door

source: guarded by %{count} %{monster}
nl: beschermt door %{count} %{monster}

source: (available: %{count})
nl: (beschikbaar: %{count})

source: (empty)
nl: (leeg)

source: already learned
nl: al geleerd

source: already knows this skill
nl: kent deze vaardigheid al

source: already has max skills
nl: heeft max vaardigheiden al

source: (already visited)
nl: (al bezocht)

source: (not visited)
nl: (not bezocht)

source: %{color} Barrier
nl: %{color} Barriere

source: Road
nl: Straat

source: (digging ok)
nl: (graven oké)

source: (no digging)
nl: (geen graven)

source: penalty: %{cost}
nl: boete: %{cost}

source: Uncharted Territory
nl: Onbekend Terrein

source: Defenders:
nl: Beschermers:

source: Unknown
nl: Onbekend

source: Attack:
nl: Aanval:

source: Defense:
nl: Verdediging:

source: Spell Power:
nl: Spreuk Kracht:

source: Knowledge:
nl: Kennis:

source: Spell Points:
nl: Spreuk Punten:

source: Move Points:
nl: Bewegings Punten:

source: Cost per troop:
nl: Kosten per troep:

source: Available: %{count}
nl: Beschrikbaar: %{count}

source: Number to buy:
nl: Hoeveelheid om te kopen:

source: Select Game Resolution:
nl: Selecteer Spel Resolutie:

source: Click to apply the selected resolution.
nl: Klik om de geselecteerde resolutie te toepassen.

source: How many troops to move?
nl: Hoe veel troepen te bewegen?

source: Fast separation into slots:
nl: Snelle scheiding in slots:

source: Map:
nl: Kaart:

source: Location:
nl: Locatie:

source: File to Save:
nl: Bestand om op te slaan:

source: File to Load:
nl: Bestand om te laden:

source: Click to save the current game.
nl: Kilk om het huidige spel op te slapen.

source: Click to load a previously saved game.
nl: Klik om een vorig opgeslagen spel te laden.

source: Are you sure you want to delete file:
nl: Weet je zeger dat je wilt verwijderen:

source: Warning!
nl: Waarschuuwing!

source: Select Monster:
nl: Selecteer Monsters:

source: Select Hero:
nl: Selecteer Held:

source: Select Artifact:
nl: Selecteer Artefact

source: Select Spell:
nl: Selecteer Spreuk:

source: Select Skill:
nl: Selecteer Vaardigheid:

source: Location:
nl: Locatie:

source: Map Type:
nl: Kaart Type:

source: The Succession Wars
nl: De Opvolgingsoorlogen

source: Lose all your heroes and towns.
nl: Verlies al je helden en steden.

source: Lose a specific town.
nl: Verlies een specifieke stad:

source: Lose a specific hero.
nl: Verlies een specifieke held:

source: Run out of time. Fail to win by a certain point.
nl: Geen tijd meer. Niet winnen op een bepaald punt.

source: Loss Condition
nl: Verlies Conditie

source: Defeat all enemy heroes and towns.
nl: Versla alle veihand helden en dorpen.

source: Capture a specific town.
nl: Verover een specifiek dorp.

source: Defeat a specific hero.
nl: Versla een specifieke held.

source: Find a specific artifact.
nl: Vind een specifiek artefact.

source: Your side defeats the opposing side.
nl: Jouw kant verslaat de tegenpartij.

source: Accumulate a large amount of gold.
nl: Verzamel een grote hoeveelheid goud.

source: Victory Condition
nl: Overwinnings Conditie

source: Map difficulty:
nl: Kaart moeilijkheid:

source: No maps exist at that size
nl: Geen kaarten bestaan voor die grote

source: Small Maps
nl: Kleine Kaarten

source: View only maps of size small (36 x 36).
nl: Bekijk alleen kaarten van de groote klein (36 x 36).

source: Medium Maps
nl: Medium Kaarten

source: View only maps of size medium (72 x 72).
nl: Bekijk alleen kaarten van de groote medium (72 x 72).

source: Large Maps
nl: Groote Kaarten

source: View only maps of size large (108 x 108).
nl: Bekijk alleen kaarten van de groote groot (108 x 108).

source: Extra Large Maps
nl: Extra Groote Kaarten

source: View only maps of size extra large (144 x 144).
nl: Bekijk alleen kaarten van de groote extra groot (144 x 144).

source: All Maps
nl: Alle Kaarten

source: View all maps, regardless of size.
nl: Bekijk alle kaarten, ongeacht de grootte.

source: Players Icon
nl: Speler Icoon

source: Indicates how many players total are in the scenario. Any positions not occupied by humans will be occupied by computer players.
nl: Geeft aan hoeveel spelers er in totaal in het scenario zitten. Alle posities die niet door mensen worden ingenomen, worden ingenomen door computerspelers.

source: Indicates whether the map is small (36 x 36), medium (72 x 72), large (108 x 108), or extra large (144 x 144).
nl: Geeft weer of de kaart klein is (36 x 36), medium (72 x 72), groot (108 x 108), of extra groot (144 x 144).

source: Size Icon
nl: Groote Icoon

source: Indicates whether the map is made for "The Succession Wars" or "The Price of Loyalty" version of the game.
nl: Geeft aan of de kaart is gemaakt voor de versie "The Succession Wars" of "The Price of Loyalty" van het spel.

source: Map Type
nl: Kaart Type

source: Selected Name
nl: Geselecteerde Naam

source: The name of the currently selected map.
nl: De naam van de huidig geselecteerde kaart.

source: Selected Map Difficulty
nl: Selecteer Kaart Moeilijkheid

source: The map difficulty of the currently selected map. The map difficulty is determined by the scenario designer. More difficult maps might include more or stronger enemies, fewer resources, or other special conditions making things tougher for the human player.
nl: De kaart moeilijkheidsgraad van de momenteel geselecteerde kaart. De moeilijkheidsgraad van de kaart wordt bepaald door de scenarioontwerper. Moeilijkere kaarten kunnen meer of sterkere vijanden bevatten, minder middelen of andere speciale omstandigheden die het moeilijker maken voor de menselijke speler.

source: Selected Description
nl: Geselecteerde Beschrijving

source: The description of the currently selected map.
nl: De beschrijving van de huidig geselecteerde kaart.

source: Accept the choice made.
nl: Accepteer de keuze gemaakt.

source: Experimental Game Settings
nl: Experimenteele Spel Instellingen

source: Jump
nl: Spring

source: Hero Speed
nl: Held Snelheid

source: Don't Show
nl: Laat niet zien

source: Enemy Speed
nl: Veihand Snelheid

source: Scroll Speed
nl: Rol Snelheid

source: Show
nl: Tonen

source: Change the speed at which your heroes move on the main screen.
nl: Verander de snelheid waarmee je helden op het hoofdscherm bewegen.

source: Sets the speed that A.I. heroes move at. You can also elect not to view A.I. movement at all.
nl: Stelt de snelheid in waarmee A.I. helden verhuizen naar. U kunt er ook voor kiezen om A.I. beweging helemaal niet.

source: Sets the speed at which you scroll the window.
nl: Stelt de snelheid in waarmee u door het venster bladert.

source: Toggle interface visibility.
nl: Schakel de zichtbaarheid van de interface.

source: Def.
nl: Kracht

source: Knowl
nl: Kennis

source: 1st
nl: 1e

source: 2nd
nl: 2e

source: 3rd
nl: 3e

source: 4th
nl: 4e

source: 5th
nl: 5e

source: 6th
nl: 6e

source: Oracle: Player Rankings
nl: Oracle: Speler Rangen

source: Thieves' Guild: Player Rankings
nl: Dievengilde: Speler Rangen

source: Number of Towns:
nl: Nummer van Dorpen:

source: Number of Castles:
nl: Nummer van Kastelen:

source: Number of Heroes:
nl: Nummer van Helden:

source: Gold in Treasury:
nl: Goud in Schatkist

source: Wood & Ore:
nl: Houd & Erts:

source: Gems, Cr, Slf & Mer:
nl: Els, Cr, Slf & Mer:

source: Obelisks Found:
nl: Obelisks Gevonden:

source: Artifacts:
nl: Artefacts:

source: Total Army Strength:
nl: Totale Leger Kracht:

source: Income:
nl: Inkomen:

source: Best Hero:
nl: Beste Held:

source: Best Hero Stats:
nl: Beste Held Statistieken:

source: Personality:
nl: Personaliteit:

source: Best Monster:
nl: Beste Monster:

source: difficulty|Easy
nl: Makkelijk

source: difficulty|Normal
nl: Normaal

source: difficulty|Hard
nl: Moeilijk

source: difficulty|Expert
nl: Expert
