Repository: ihhub/fheroes2
Catalog: files/lang/*.po
Languages: nl

source: The keeper of the mill announces: "Milord, I have been working very hard to provide you with these resources, come back next week for more."
nl: De molenaar kondigt aan: "Heer, ik heb heel hard gewerkt om u van deze middelen te voorzien, kom volgende week terug voor meer."

source: The keeper of the mill announces: "Milord, I am sorry, there are no resources currently available. Please try again next week."
nl: De molenaar kondigt aan: "Heer, het spijt me, er zijn momenteel geen middelen beschikbaar. Probeer het volgende week opnieuw."

source: The keeper of the mill announces: "Milord, I have been working very hard to provide you with this gold, come back next week for more."
nl: De molenaar kondigt aan: "Heer, ik heb heel hard gewerkt om u van dit goud te voorzien, kom volgende week terug voor meer."

source: The keeper of the mill announces: "Milord, I am sorry, there is no gold currently available. Please try again next week."
nl: De molenaar kondigt aan: "Heer, het spijt me, er is momenteel geen goud beschikbaar. Probeer het volgende week opnieuw."

source: You've found an abandoned lean-to. Poking about, you discover some resources hidden nearby.
nl: Je hebt een verlaten afdak gevonden. Als je rondneust, ontdek je enkele bronnen die in de buurt verborgen zijn.

source: The lean-to is long abandoned. There is nothing of value here.
nl: De aanbouw is al lang verlaten. Er is hier niets van waarde.

source: You catch a leprechaun foolishly sleeping amidst a cluster of magic mushrooms. In exchange for his freedom, he guides you to a small pot filled with precious things.
nl: Je betrapt een kabouter die dwaas slaapt tussen een tros magische paddestoelen. In ruil voor zijn vrijheid leidt hij je naar een kleine pot gevuld met kostbare dingen.

source: You've found a magic garden, the kind of place that leprechauns and faeries like to cavort in, but there is no one here today. Perhaps you should try again next week.
nl: Je hebt een magische tuin gevonden, het soort plek waar kabouters en elfen graag rondscharrelen, maar er is hier niemand vandaag. Misschien moet je het volgende week nog eens proberen.

source: You come upon the remains of an unfortunate adventurer.
nl: Je komt op de overblijfselen van een ongelukkige avonturier.

source: Treasure
nl: Schat

source: Searching through the tattered clothing, you find the %{artifact}.
nl: Als je door de gescheurde kleding zoekt, vind je het %{artefact}.

source: Searching through the tattered clothing, you find nothing.
nl: Zoekend door de gescheurde kleding, vind je niets.

source: You come across an old wagon left by a trader who didn't quite make it to safe terrain.
nl: Je komt een oude wagen tegen die is achtergelaten door een handelaar die niet helemaal veilig op het terrein is gekomen.

source: Unfortunately, others have found it first, and the wagon is empty.
nl: Helaas hebben anderen het als eerste gevonden en is de wagen leeg.

source: Searching inside, you find the %{artifact}.
nl: Als je naar binnen zoekt, vind je het %{artefact}.

source: Inside, you find some of the wagon's cargo still intact.
nl: Binnenin vind je een deel van de lading van de wagen nog intact.

source: You search through the flotsam, and find some wood and some gold.
nl: Je zoekt door het wrak en vindt wat hout en wat goud.

source: You search through the flotsam, and find some wood.
nl: Je zoekt door het wrak en vindt wat hout.

source: You search through the flotsam, but find nothing.
nl: Je zoekt door het wrak, maar vindt niets.

source: Shrine of the 1st Circle
nl: Heiligdom van de 1e cirkel

source: You come across a small shrine attended by a group of novice acolytes. In exchange for your protection, they agree to teach you a simple spell - '%{spell}'.
nl: Je komt een klein heiligdom tegen dat wordt bijgewoond door een groep beginnende volgelingen. In ruil voor jouw bescherming komen ze overeen om je een eenvoudige spreuk te leren - '%{spell}'.

source: Shrine of the 2nd Circle
nl: Heiligdom van de 2e cirkel

source: You come across an ornate shrine attended by a group of rotund friars. In exchange for your protection, they agree to teach you a spell - '%{spell}'.
nl: Je komt een sierlijk heiligdom tegen dat wordt bijgewoond door een groep ronde broeders. In ruil voor je bescherming, gaan ze ermee akkoord je een spreuk te leren - '%{spell}'.

source: Shrine of the 3rd Circle
nl: Heiligdom van de 3e cirkel

source: You come across a lavish shrine attended by a group of high priests. In exchange for your protection, they agree to teach you a sophisticated spell - '%{spell}'.
nl: Je komt een weelderig heiligdom tegen dat wordt bijgewoond door een groep hogepriesters. In ruil voor jouw bescherming komen ze overeen om je een verfijnde spreuk te leren - '%{spell}'.

source: Unfortunately, you have no Magic Book to record the spell with.
nl: Helaas heb je geen Magisch Boek om de spreuk mee op te nemen.

source: Unfortunately, you do not have the wisdom to understand the spell, and you are unable to learn it.
nl: Helaas heb je niet de wijsheid om de betovering te begrijpen, en je bent niet in staat om het te leren.

source: Unfortunately, you already have knowledge of this spell, so there is nothing more for them to teach you.
nl: Helaas heb je al kennis van deze spreuk, dus er is niets meer voor hen om je te leren.

source: You approach the hut and observe a witch inside studying an ancient tome on %{skill}.
nl: Je nadert de hut en ziet een heks binnen die een oud boekdeel bestudeert op %{skill}.

source: As you approach, she turns and focuses her one glass eye on you. "You already know everything you deserve to learn!" the witch screeches. "NOW GET OUT OF MY HOUSE!"
nl: Als je dichterbij komt, draait ze zich om en richt haar ene glazen oog op je. "Je weet al alles wat je verdient te leren!" schreeuwt de heks. "GA NU UIT MIJN HUIS!"

source: As you approach, she turns and speaks. "You already know that which I would teach you. I can help you no further."
nl: Als je dichterbij komt, draait ze zich om en spreekt. "Wat ik je zou leren, weet je al. Ik kan je niet verder helpen."

source: An ancient and immortal witch living in a hut with bird's legs for stilts teaches you %{skill} for her own inscrutable purposes.
nl: Een oude en onsterfelijke heks die in een hut woont met vogelpoten als stelten, leert je %{vaardigheid} voor haar eigen ondoorgrondelijke doeleinden.

source: As you drink the sweet water, you gain luck for your next battle.
nl: Terwijl je het zoete water drinkt, krijg je geluk voor je volgende gevecht.

source: You drink from the enchanted fountain, but nothing happens.
nl: Je drinkt uit de betoverde fontein, maar er gebeurt niets.

source: Upon entering the mystical faerie ring, your army gains luck for its next battle.
nl: Bij het betreden van de mystieke elfenring krijgt je leger geluk voor zijn volgende gevecht.

source: You enter the faerie ring, but nothing happens.
nl: Je gaat de elfenring binnen, maar er gebeurt niets.

source: You've found an ancient and weathered stone idol. It is supposed to grant luck to visitors, but since the stars are already smiling upon you, it does nothing.
nl: Je hebt een oud en verweerd stenen idool gevonden. Het wordt verondersteld om bezoekers geluk te schenken, maar aangezien de sterren al naar je glimlachen, doet het niets.

source: You've found an ancient and weathered stone idol. Kissing it is supposed to be lucky, so you do. The stone is very cold to the touch.
nl: Je hebt een oud en verweerd stenen idool gevonden. Het kussen zou geluk moeten brengen, dus dat doe je. De steen voelt erg koud aan.

source: The mermaids silently entice you to return later and be blessed again.
nl: De zeemeerminnen verleiden je in stilte om later terug te keren en opnieuw gezegend te worden.

source: The magical, soothing beauty of the Mermaids reaches you and your crew. Just for a moment, you forget your worries and bask in the beauty of the moment. The mermaids charms bless you with increased luck for your next combat.
nl: De magische, rustgevende schoonheid van de zeemeerminnen bereikt jou en je bemanning. Even vergeet je je zorgen en koester je de schoonheid van het moment. De charmes van de zeemeerminnen zegenen je met meer geluk voor je volgende gevecht.

source: You come upon the pyramid of a great and ancient king. You are tempted to search it for treasure, but all the old stories warn of fearful curses and undead guardians. Will you search?
nl: Je komt op de piramide van een grote en oude koning. Je komt in de verleiding om er naar schatten te zoeken, maar alle oude verhalen waarschuwen voor angstaanjagende vloeken en ondode bewakers. Ga je zoeken?

source: Upon defeating the monsters, you decipher an ancient glyph on the wall, telling the secret of the spell - '
nl: Nadat je de monsters hebt verslagen, ontcijfer je een oude glyph op de muur, die het geheim van de spreuk vertelt - '

source: Unfortunately, you have no Magic Book to record the spell with.
nl: Helaas heb je geen Magisch Boek om de spreuk mee op te nemen.

source: Unfortunately, you do not have the wisdom to understand the spell, and you are unable to learn it.
nl: Helaas heb je niet de wijsheid om de betovering te begrijpen, en je bent niet in staat om het te leren.

source: You come upon the pyramid of a great and ancient king. Routine exploration reveals that the pyramid is completely empty.
nl: Je komt op de piramide van een grote en oude koning. Routinematige verkenning onthult dat de piramide helemaal leeg is.

source: A drink at the well is supposed to restore your spell points, but you are already at maximum.
nl: Een drankje bij de bron zou je spellpoints moeten herstellen, maar je zit al aan het maximum.

source: A second drink at the well in one day will not help you.
nl: Een tweede drankje bij de bron op één dag zal je niet helpen.

source: A drink from the well has restored your spell points to maximum.
nl: Een drankje uit de put heeft je spreuken weer op het maximum gebracht.

source: "I'm sorry sir," The leader of the soldiers says, "but you already know everything we have to teach."
nl: "Het spijt me meneer," zegt de leider van de soldaten, "maar u weet al alles wat we moeten leren."

source: The soldiers living in the fort teach you a few new defensive tricks.
nl: De soldaten die in het fort wonen, leren je een paar nieuwe verdedigingstrucs.

source: You've come upon a mercenary camp practicing their tactics. "You're too advanced for us," the mercenary captain says. "We can teach nothing more."
nl: Je bent een huurlingenkamp tegengekomen die hun tactieken oefent. "Je bent te geavanceerd voor ons," zegt de huurlingenkapitein. "We kunnen niets meer leren."

source: You've come upon a mercenary camp practicing their tactics. The mercenaries welcome you and your troops and invite you to train with them.
nl: Je bent een huurlingenkamp tegengekomen die hun tactieken oefent. De huurlingen verwelkomen jou en je troepen en nodigen je uit om met hen te trainen.

source: "Go 'way!", the witch doctor barks, "you know all I know."
nl: "Ga weg!", blaft de heksen doctor, "je weet alles dat ik weet."

source: An Orcish witch doctor living in the hut deepens your knowledge of magic by showing you how to cast stones, read portents, and decipher the intricacies of chicken entrails.
nl: Een Orcish-toverdokter die in de hut woont, verdiept je kennis van magie door je te laten zien hoe je stenen kunt werpen, voortekenen kunt lezen en de fijne kneepjes van de ingewanden van kippen kunt ontcijferen.

source: You've found a group of Druids worshipping at one of their strange stone edifices. Silently, the Druids turn you away, indicating they have nothing new to teach you.Je hebt een groep Druïden gevonden die aanbidden in een van hun vreemde stenen gebouwen. In stilte wijzen de Druïden je af, wat aangeeft dat ze je niets nieuws te leren hebben.
nl: Je hebt een groep Druïden gevonden die aanbidden in een van hun vreemde stenen gebouwen. In stilte leren ze je nieuwe manieren om spreuken uit te spreken.

source: You tentatively approach the burial ground of ancient warriors. Do you want to search the graves?
nl: Je nadert voorzichtig de begraafplaats van oude krijgers. Wil je de graven doorzoeken?

source: You spend several hours searching the graves and find nothing. Such a despicable act reduces your army's morale.
nl: Je besteedt enkele uren aan het doorzoeken van de graven en vindt niets. Zo'n verachtelijke daad verlaagt het moreel van je leger.

source: Upon defeating the Zombies you search the graves and find something!
nl: Na het verslaan van de Zombies doorzoek je de graven en vind je iets!

source: The rotting hulk of a great pirate ship creaks eerily as it is pushed against the rocks. Do you wish to search the shipwreck?
nl: De rottende romp van een groot piratenschip kraakt griezelig als het tegen de rotsen wordt geduwd. Wilt u het scheepswrak doorzoeken?

source: You spend several hours sifting through the debris and find nothing. Such a despicable act reduces your army's morale.
nl: Je besteedt enkele uren aan het doorzoeken van het puin en vindt niets. Zo'n verachtelijke daad verlaagt het moreel van je leger.

source: Upon defeating the Ghosts you sift through the debris and find something!
nl: Nadat je de Geesten hebt verslagen, doorzoek je het puin en vind je iets!

source: The rotting hulk of a great pirate ship creaks eerily as it is pushed against the rocks. Do you wish to search the ship?
nl: De rottende romp van een groot piratenschip kraakt griezelig als het tegen de rotsen wordt geduwd. Wilt u het schip doorzoeken?

source: Upon defeating the Skeletons you sift through the debris and find something!
nl: Nadat je de Skeleten hebt verslagen, doorzoek je het puin en vind je iets!

source: Your men spot a navigational buoy, confirming that you are on course.
nl: Je mannen zien een navigatieboei, wat bevestigt dat je op koers zit.

source: Your men spot a navigational buoy, confirming that you are on course and increasing their morale.
nl: Je mannen zien een navigatieboei, die bevestigt dat je op koers zit en hun moreel verhoogt.

source: The drink at the oasis is refreshing, but offers no further benefit. The oasis might help again if you fought a battle first.
nl: Het drankje bij de oase is verfrissend, maar biedt verder geen voordeel. De oase kan misschien weer helpen als je eerst een gevecht hebt geleverd.

source: A drink at the oasis fills your troops with strength and lifts their spirits. You can travel a bit further today.
nl: Een drankje in de oase vervult je troepen met kracht en vrolijkt ze op. Je kunt vandaag wat verder reizen.

source: The drink at the watering hole is refreshing, but offers no further benefit. The watering hole might help again if you fought a battle first.
nl: Het drankje bij de drinkplaats is verfrissend, maar biedt verder geen voordelen. De waterpoel kan weer helpen als je eerst een gevecht hebt geleverd.

source: A drink at the watering hole fills your troops with strength and lifts their spirits. You can travel a bit further today.
nl: Een drankje bij de drinkplaats vervult je troepen met kracht en vrolijkt ze op. Je kunt vandaag wat verder reizen.

source: It doesn't help to pray twice before a battle. Come back after you've fought.
nl: Het helpt niet om twee keer te bidden voor een gevecht. Kom terug nadat je gevochten hebt.

source: A visit and a prayer at the temple raises the morale of your troops.
nl: Een bezoek en een gebed in de tempel verhogen het moreel van je troepen.

source: An old Knight appears on the steps of the gazebo. "I am sorry, my liege, I have taught you all I can."
nl: Een oude ridder verschijnt op de trappen van het prieel. "Het spijt me, leenheer, ik heb u alles geleerd wat ik kan."

source: An old Knight appears on the steps of the gazebo. "My liege, I will teach you all that I know to aid you in your travels."
nl: Een oude ridder verschijnt op de trappen van het prieel. "Mijn leenheer, ik zal je alles leren wat ik weet om je te helpen op je reizen."

source: You've pulled a shipwreck survivor from certain death in an unforgiving ocean. Grateful, he says, "I would give you an artifact as a reward, but you're all full."
nl: Je hebt een overlevende van een schipbreuk gered van een wisse dood in een meedogenloze oceaan. Dankbaar zegt hij: "Ik zou je een artefact geven als beloning, maar je zit helemaal vol."

source: You've pulled a shipwreck survivor from certain death in an unforgiving ocean. Grateful, he rewards you for your act of kindness by giving you the %{art}.
nl: Je hebt een overlevende van een schipbreuk gered van een wisse dood in een meedogenloze oceaan. Dankbaar beloont hij je voor je vriendelijke daad door je de %{art} te geven.

source: A leprechaun offers you the %{art} for the small price of %{gold} Gold.
nl: Een kabouter biedt je de %{art} voor de kleine prijs van %{gold} Goud.

source: A leprechaun offers you the %{art} for the small price of %{gold} Gold and %{count} %{res}.
nl: Een kabouter biedt je de %{art} aan voor de kleine prijs van %{gold} Goud en %{count} %{res}.

source: Do you wish to buy this artifact?
nl: Wilt u dit artefact kopen?

source: You try to pay the leprechaun, but realize that you can't afford it. The leprechaun stamps his foot and ignores you.
nl: Je probeert de kabouter te betalen, maar realiseert je dat je het niet kunt betalen. De kabouter stampt met zijn voet en negeert je.

source: Insulted by your refusal of his generous offer, the leprechaun stamps his foot and ignores you.
nl: Beledigd door jouw weigering van zijn genereuze aanbod, stampt de kabouter met zijn voet en negeert hij je.

source: You've found the artifact:
nl: Je hebt het artefact gevonden:

source: You've found the humble dwelling of a withered hermit. The hermit tells you that he is willing to give the %{art} to the first wise person he meets.
nl: Je hebt de nederige woning van een verdorde kluizenaar gevonden. De kluizenaar vertelt je dat hij bereid is om de %{art} te geven aan de eerste wijze persoon die hij ontmoet.

source: You've come across the spartan quarters of a retired soldier. The soldier tells you that he is willing to pass on the %{art} to the first true leader he meets.
nl: Je bent de Spartaanse vertrekken tegengekomen van een gepensioneerde soldaat. De soldaat vertelt je dat hij bereid is om de %{art} door te geven aan de eerste echte leider die hij ontmoet.

source: You've encountered a strange person with a hat and an owl on it. He tells you that he is willing to give %{art} if you have %{skill}.
nl: Je bent een vreemd persoon tegengekomen met een hoed en een uil erop. Hij vertelt je dat hij bereid is %{art} te geven als je %{skill} hebt.

source: You come upon an ancient artifact. As you reach for it, a pack of Rogues leap out of the brush to guard their stolen loot.
nl: Je komt een oud artefact tegen. Terwijl je ernaar reikt, springt een groep Rogues uit het struikgewas om hun gestolen buit te bewaken.

source: Through a clearing you observe an ancient artifact. Unfortunately, it's guarded by a nearby %{monster}. Do you want to fight the %{monster} for the artifact?
nl: Via een open plek observeer je een oud artefact. Helaas wordt het bewaakt door een nabijgelegen %{monster}. Wil je het %{monster} bevechten voor het artefact?

source: Victorious, you take your prize, the %{art}.
nl: Zegevierend, je neemt je prijs, de %{art}.

source: Discretion is the better part of valor, and you decide to avoid this fight for today.
nl: Discretie is het beste deel van moed, en je besluit deze strijd voor vandaag te vermijden.

source: After spending hours trying to fish the chest out of the sea, you open it and find %{gold} gold pieces.
nl: Nadat je uren hebt geprobeerd om de kist uit de zee te vissen, open je hem en vind je %{gold} goudstukken.

source: After spending hours trying to fish the chest out of the sea, you open it and find %{gold} gold and the %{art}.
nl: Na urenlang geprobeerd te hebben om de kist uit de zee te vissen, open je hem en vind je %{gold} goud en de %{art}.

source: After spending hours trying to fish the chest out of the sea, you open it, only to find it empty.
nl: Nadat je urenlang hebt geprobeerd de kist uit de zee te vissen, open je hem, alleen om hem leeg te vinden.

source: After scouring the area, you fall upon a hidden treasure cache. You may take the gold or distribute the gold to the peasants for experience. Do you wish to keep the gold?
nl: Nadat je het gebied hebt doorzocht, val je op een verborgen schatcache. Je mag het goud nemen of het goud uitdelen aan de boeren voor ervaring. Wilt u het goud houden?

source: After scouring the area, you fall upon a hidden chest, containing the %{gold} gold pieces.
nl: Nadat je het gebied hebt doorzocht, val je op een verborgen kist met daarin de %{gold} goudstukken.

source: After scouring the area, you fall upon a hidden chest, containing the ancient artifact %{art}.
nl: Nadat je het gebied hebt doorzocht, val je op een verborgen kist met het oude artefact %{art}.

source: You stumble upon a dented and tarnished lamp lodged deep in the earth. Do you wish to rub the lamp?
nl: je stuit op een gedeukte en doffe lamp die diep in de aarde zit. Wil je de lamp wrijven?

source: You come upon an abandoned gold mine. The mine appears to be haunted. Do you wish to enter?
nl: Je komt een verlaten goudmijn tegen. De mijn lijkt te worden achtervolgd. Wil je binnenkomen?

source: You have taken control of the local Alchemist shop. It will provide you with %{count} unit of Mercury per day.
nl: Je hebt de controle over de plaatselijke Alchemist-winkel overgenomen. Het geeft je %{count} kwikeenheid per dag.

source: You gain control of a sawmill. It will provide you with %{count} units of wood per day.
nl: Je krijgt de controle over een zagerij. Het geeft je %{count} eenheden hout per dag.

source: You beat the Ghosts and are able to restore the mine to production.
nl: Je verslaat de Geesten en bent in staat om de mijn weer in productie te nemen.

source: You gain control of an ore mine. It will provide you with %{count} units of ore per day.
nl: Je krijgt de controle over een ertsmijn. Het geeft je %{count} eenheden erts per dag.

source: You gain control of a sulfur mine. It will provide you with %{count} unit of sulfur per day.
nl: Je krijgt de controle over een zwavelmijn. Het geeft je %{count} eenheid zwavel per dag.

source: You gain control of a crystal mine. It will provide you with %{count} unit of crystal per day.
nl: Je krijgt de controle over een kristalmijn. Het geeft je %{count} kristaleenheid per dag.

source: You gain control of a gem mine. It will provide you with %{count} unit of gems per day.
nl: Je krijgt de controle over een edelsteenmijn. Het geeft je een %{count} eenheid edelstenen per dag.

source: You gain control of a gold mine. It will provide you with %{count} gold per day.
nl: Je krijgt de controle over een goudmijn. Het levert je %{count} goud per dag op.

source: The lighthouse is now under your control, and all of your ships will now move further each day.
nl: De vuurtoren is nu onder jouw controle en al je schepen zullen nu elke dag verder gaan.

source: You gain control of a %{name}.
nl: Je krijgt de controle over een %{name}.

source: A group of %{monster} with a desire for greater glory wish to join you. Do you accept?
nl: Een groep %{monster} met een verlangen naar grotere glorie wil zich bij je aansluiten. Accepteer je?

source: As you approach the dwelling, you notice that there is no one here.
nl: Als je de woning nadert, merk je dat er niemand is.

source: You search the ruins, but the Medusas that used to live here are gone. Perhaps there will be more next week.
nl: Je doorzoekt de ruïnes, maar de Medusa's die hier vroeger leefden, zijn verdwenen. Misschien volgt er volgende week meer.
